*** src/colbert.rs:106:5: replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![vec![-1.0]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![vec![-1.0]]
@@ -98,43 +98,17 @@
     {
         pool_tokens_greedy(tokens, target_count)
     }
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-    let n = tokens.len();
-    let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
-
-    while clusters.len() > target_count {
-        let mut best_i = 0;
-        let mut best_j = 1;
-        let mut best_sim = f32::NEG_INFINITY;
-
-        for i in 0..clusters.len() {
-            for j in (i + 1)..clusters.len() {
-                let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
-                if sim > best_sim {
-                    best_sim = sim;
-                    best_i = i;
-                    best_j = j;
-                }
-            }
-        }
-
-        let merged = clusters.remove(best_j);
-        clusters[best_i].extend(merged);
-    }
-
-    clusters
-        .iter()
-        .map(|indices| mean_pool(tokens, indices))
-        .collect()
+    vec![vec![-1.0]] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Ward's method hierarchical clustering via kodama (O(n² log n), better quality).
 ///
 /// Ward's method minimizes within-cluster variance at each merge step,
 /// producing more semantically coherent clusters than greedy approaches.
 ///
 /// # Panics

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12491815) panicked at src/colbert.rs:684:5:
Test failed: Score dropped too much: 8.24 -> -1.3000001 at src/colbert.rs:835.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_dimension stdout ----

thread 'colbert::proptests::pool_preserves_dimension' (12491816) panicked at src/colbert.rs:684:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `2`: Dimension mismatch: expected 2, got 1 at src/colbert.rs:769.
minimal failing input: n_tokens = 2, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::all_pooling_methods_preserve_dim stdout ----

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12491808) panicked at src/colbert.rs:684:5:
Test failed: assertion failed: p1.iter().all(|v| v.len() == dim) at src/colbert.rs:1059.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 116 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
