*** src/colbert.rs:106:5: replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![]
@@ -98,43 +98,17 @@
     {
         pool_tokens_greedy(tokens, target_count)
     }
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-    let n = tokens.len();
-    let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
-
-    while clusters.len() > target_count {
-        let mut best_i = 0;
-        let mut best_j = 1;
-        let mut best_sim = f32::NEG_INFINITY;
-
-        for i in 0..clusters.len() {
-            for j in (i + 1)..clusters.len() {
-                let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
-                if sim > best_sim {
-                    best_sim = sim;
-                    best_i = i;
-                    best_j = j;
-                }
-            }
-        }
-
-        let merged = clusters.remove(best_j);
-        clusters[best_i].extend(merged);
-    }
-
-    clusters
-        .iter()
-        .map(|indices| mean_pool(tokens, indices))
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Ward's method hierarchical clustering via kodama (O(n² log n), better quality).
 ///
 /// Ward's method minimizes within-cluster variance at each merge step,
 /// producing more semantically coherent clusters than greedy approaches.
 ///
 /// # Panics

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12495278) panicked at src/colbert.rs:684:5:
Test failed: Score dropped too much: 8.24 -> 0 at src/colbert.rs:835.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12495280) panicked at src/colbert.rs:684:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:888.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_reduces_count stdout ----

thread 'colbert::proptests::pool_reduces_count' (12495281) panicked at src/colbert.rs:684:5:
Test failed: assertion failed: !pooled.is_empty() at src/colbert.rs:746.
minimal failing input: n_tokens = 4, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pool_reduces_count
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_reduces_count
    colbert::tests::test_pool_tokens_with_protected

test result: FAILED. 116 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
