*** src/colbert.rs:106:5: replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![vec![]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_greedy -> Vec<Vec<f32>> with vec![vec![]]
@@ -98,43 +98,17 @@
     {
         pool_tokens_greedy(tokens, target_count)
     }
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-    let n = tokens.len();
-    let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
-
-    while clusters.len() > target_count {
-        let mut best_i = 0;
-        let mut best_j = 1;
-        let mut best_sim = f32::NEG_INFINITY;
-
-        for i in 0..clusters.len() {
-            for j in (i + 1)..clusters.len() {
-                let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
-                if sim > best_sim {
-                    best_sim = sim;
-                    best_i = i;
-                    best_j = j;
-                }
-            }
-        }
-
-        let merged = clusters.remove(best_j);
-        clusters[best_i].extend(merged);
-    }
-
-    clusters
-        .iter()
-        .map(|indices| mean_pool(tokens, indices))
-        .collect()
+    vec![vec![]] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Ward's method hierarchical clustering via kodama (O(n² log n), better quality).
 ///
 /// Ward's method minimizes within-cluster variance at each merge step,
 /// producing more semantically coherent clusters than greedy approaches.
 ///
 /// # Panics

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12501486) panicked at src/colbert.rs:684:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:923.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_dimension stdout ----

thread 'colbert::proptests::pool_preserves_dimension' (12501493) panicked at src/colbert.rs:684:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`, 
 right: `2`: Dimension mismatch: expected 2, got 0 at src/colbert.rs:769.
minimal failing input: n_tokens = 2, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12501494) panicked at src/colbert.rs:684:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:888.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pooling_idempotent_at_target
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 114 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
