*** src/colbert.rs:109:26: replace > with == in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace > with == in pool_tokens_greedy
@@ -101,17 +101,17 @@
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
     let n = tokens.len();
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
 
-    while clusters.len() > target_count {
+    while clusters.len() == /* ~ changed by cargo-mutants ~ */ target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
             for j in (i + 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
                 if sim > best_sim {

---- colbert::proptests::pool_reduces_count stdout ----

thread 'colbert::proptests::pool_reduces_count' (12437711) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: pooled.len() <= expected_max + 1 at src/colbert.rs:771.
minimal failing input: n_tokens = 4, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_low_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_low_factor' (12437738) panicked at src/colbert.rs:629:9:
assertion `left == right` failed
  left: 4
 right: 2

---- colbert::tests::test_pool_tokens_reduces_count stdout ----

thread 'colbert::tests::test_pool_tokens_reduces_count' (12437741) panicked at src/colbert.rs:588:9:
assertion failed: pooled.len() <= 2

failures:
    colbert::proptests::pool_reduces_count
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_reduces_count

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
