*** src/colbert.rs:109:26: replace > with >= in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace > with >= in pool_tokens_greedy
@@ -101,17 +101,17 @@
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
     let n = tokens.len();
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
 
-    while clusters.len() > target_count {
+    while clusters.len() >= /* ~ changed by cargo-mutants ~ */ target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
             for j in (i + 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
                 if sim > best_sim {

---- colbert::proptests::all_pooling_methods_preserve_dim stdout ----

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12540444) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12540444) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12540444) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12540444) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

---- colbert::proptests::pooling_never_increases_count stdout ----

thread 'colbert::proptests::pooling_never_increases_count' (12540456) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::pooling_never_increases_count' (12540456) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::pooling_never_increases_count' (12540456) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::pooling_never_increases_count' (12540456) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

---- colbert::proptests::protected_tokens_preserved stdout ----

thread 'colbert::proptests::protected_tokens_preserved' (12540457) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::protected_tokens_preserved' (12540457) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::protected_tokens_preserved' (12540457) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)

thread 'colbert::proptests::protected_tokens_preserved' (12540457) panicked at src/colbert.rs:125:31:
removal index (is 1) should be < len (is 1)
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-2ZFznG.tmp/proptest-regressions/colbert.txt

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::maxsim_pooled_finite
    colbert::proptests::pool_preserves_dimension
    colbert::proptests::pool_reduces_count
    colbert::proptests::pooling_never_increases_count
    colbert::proptests::protected_tokens_preserved
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_with_protected
    scoring::proptests::pooler_never_increases_count
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 114 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
