*** src/colbert.rs:115:25: replace + with * in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace + with * in pool_tokens_greedy
@@ -107,17 +107,17 @@
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
 
     while clusters.len() > target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
-            for j in (i + 1)..clusters.len() {
+            for j in (i * /* ~ changed by cargo-mutants ~ */ 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
                 if sim > best_sim {
                     best_sim = sim;
                     best_i = i;
                     best_j = j;
                 }
             }
         }

---- colbert::proptests::maxsim_pooled_finite stdout ----

thread 'colbert::proptests::maxsim_pooled_finite' (12458669) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

thread 'colbert::proptests::maxsim_pooled_finite' (12458669) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

thread 'colbert::proptests::maxsim_pooled_finite' (12458669) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

thread 'colbert::proptests::maxsim_pooled_finite' (12458669) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12458666) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 6 but the index is 6

thread 'colbert::proptests::duplicate_tokens_cluster' (12458666) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 7 but the index is 7

thread 'colbert::proptests::duplicate_tokens_cluster' (12458666) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

thread 'colbert::proptests::duplicate_tokens_cluster' (12458666) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 4 but the index is 4

---- colbert::proptests::pool_reduces_count stdout ----

thread 'colbert::proptests::pool_reduces_count' (12458675) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 3 but the index is 3

thread 'colbert::proptests::pool_reduces_count' (12458675) panicked at src/colbert.rs:126:17:
index out of bounds: the len is 3 but the index is 3

thread 'colbert::proptests::pool_reduces_count' (12458675) panicked at src/colbert.rs:710:5:
Test failed: index out of bounds: the len is 3 but the index is 3.
minimal failing input: n_tokens = 4, dim = 7, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::adaptive_uses_clustering_for_low_factors
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::maxsim_pooled_finite
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pool_reduces_count
    colbert::proptests::pooling_idempotent_at_target
    colbert::proptests::pooling_never_increases_count
    colbert::proptests::protected_tokens_preserved
    colbert::tests::test_maxsim_with_pooled_tokens

test result: FAILED. 109 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
