*** src/colbert.rs:115:25: replace + with - in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace + with - in pool_tokens_greedy
@@ -107,17 +107,17 @@
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();
 
     while clusters.len() > target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
-            for j in (i + 1)..clusters.len() {
+            for j in (i - /* ~ changed by cargo-mutants ~ */ 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
                 if sim > best_sim {
                     best_sim = sim;
                     best_i = i;
                     best_j = j;
                 }
             }
         }

---- colbert::proptests::adaptive_uses_clustering_for_low_factors stdout ----

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12577114) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12577114) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12577114) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12577114) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

---- colbert::proptests::pool_preserves_dimension stdout ----

thread 'colbert::proptests::pool_preserves_dimension' (12577124) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::pool_preserves_dimension' (12577124) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::pool_preserves_dimension' (12577124) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::pool_preserves_dimension' (12577124) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

---- colbert::proptests::maxsim_pooled_finite stdout ----

thread 'colbert::proptests::maxsim_pooled_finite' (12577120) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::maxsim_pooled_finite' (12577120) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::maxsim_pooled_finite' (12577120) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

thread 'colbert::proptests::maxsim_pooled_finite' (12577120) panicked at src/colbert.rs:115:22:
attempt to subtract with overflow

failures:
    colbert::proptests::adaptive_uses_clustering_for_low_factors
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::maxsim_pooled_finite
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pool_reduces_count
    colbert::proptests::pooling_idempotent_at_target
    colbert::proptests::pooling_never_increases_count
    colbert::proptests::protected_tokens_preserved
    colbert::tests::test_maxsim_with_pooled_tokens

test result: FAILED. 106 passed; 18 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
