*** src/colbert.rs:117:24: replace > with == in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace > with == in pool_tokens_greedy
@@ -109,17 +109,17 @@
     while clusters.len() > target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
             for j in (i + 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
-                if sim > best_sim {
+                if sim == /* ~ changed by cargo-mutants ~ */ best_sim {
                     best_sim = sim;
                     best_i = i;
                     best_j = j;
                 }
             }
         }
 
         let merged = clusters.remove(best_j);

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12422736) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0.9070101 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.95s

*** result: Failure(101)
