*** src/colbert.rs:117:24: replace > with >= in pool_tokens_greedy

*** mutation diff:
--- src/colbert.rs
+++ replace > with >= in pool_tokens_greedy
@@ -109,17 +109,17 @@
     while clusters.len() > target_count {
         let mut best_i = 0;
         let mut best_j = 1;
         let mut best_sim = f32::NEG_INFINITY;
 
         for i in 0..clusters.len() {
             for j in (i + 1)..clusters.len() {
                 let sim = cluster_similarity(tokens, &clusters[i], &clusters[j]);
-                if sim > best_sim {
+                if sim >= /* ~ changed by cargo-mutants ~ */ best_sim {
                     best_sim = sim;
                     best_i = i;
                     best_j = j;
                 }
             }
         }
 
         let merged = clusters.remove(best_j);

*** result: Success
