*** src/colbert.rs:155:21: replace + with * in pool_tokens_hierarchical

*** mutation diff:
--- src/colbert.rs
+++ replace + with * in pool_tokens_hierarchical
@@ -147,17 +147,17 @@
 
     let n = tokens.len();
 
     // Build condensed distance matrix (upper triangular, row-major)
     // Distance = 1 - cosine_similarity (so similar tokens have low distance)
     // kodama requires all values to be finite non-NaN
     let mut condensed = Vec::with_capacity(n * (n - 1) / 2);
     for i in 0..n {
-        for j in (i + 1)..n {
+        for j in (i * /* ~ changed by cargo-mutants ~ */ 1)..n {
             let sim = simd::cosine(&tokens[i], &tokens[j]);
             // Handle NaN (from zero-norm vectors) by treating as max distance
             let sim_safe = if sim.is_nan() { -1.0 } else { sim };
             // Convert similarity to distance, clamped to [0, 2]
             #[allow(clippy::cast_lossless)]
             let dist = f64::from((1.0 - sim_safe).clamp(0.0, 2.0));
             condensed.push(dist);
         }

*** result: Success
