*** src/colbert.rs:161:39: replace - with / in pool_tokens_hierarchical

*** mutation diff:
--- src/colbert.rs
+++ replace - with / in pool_tokens_hierarchical
@@ -153,17 +153,17 @@
     let mut condensed = Vec::with_capacity(n * (n - 1) / 2);
     for i in 0..n {
         for j in (i + 1)..n {
             let sim = simd::cosine(&tokens[i], &tokens[j]);
             // Handle NaN (from zero-norm vectors) by treating as max distance
             let sim_safe = if sim.is_nan() { -1.0 } else { sim };
             // Convert similarity to distance, clamped to [0, 2]
             #[allow(clippy::cast_lossless)]
-            let dist = f64::from((1.0 - sim_safe).clamp(0.0, 2.0));
+            let dist = f64::from((1.0 / /* ~ changed by cargo-mutants ~ */ sim_safe).clamp(0.0, 2.0));
             condensed.push(dist);
         }
     }
 
     // Run Ward's method linkage
     let dendrogram = linkage(&mut condensed, n, Method::Ward);
 
     // Cut dendrogram to get target_count clusters

*** result: Success
