*** src/colbert.rs:200:25: replace != with == in cut_dendrogram::find

*** mutation diff:
--- src/colbert.rs
+++ replace != with == in cut_dendrogram::find
@@ -192,17 +192,17 @@
     target_count: usize,
 ) -> Vec<usize> {
     // Each step merges two clusters, so we need (n - target_count) merges
     let steps_to_take = n.saturating_sub(target_count);
 
     // Union-find helper for path compression
     #[allow(clippy::items_after_statements)]
     fn find(parent: &mut [usize], mut x: usize) -> usize {
-        while parent[x] != x {
+        while parent[x] == /* ~ changed by cargo-mutants ~ */ x {
             parent[x] = parent[parent[x]]; // path compression
             x = parent[x];
         }
         x
     }
 
     // Union-find to track cluster membership
     let mut parent: Vec<usize> = (0..2 * n).collect();

*** result: Success
