*** src/colbert.rs:200:9: replace cut_dendrogram::find -> usize with 1

*** mutation diff:
--- src/colbert.rs
+++ replace cut_dendrogram::find -> usize with 1
@@ -192,21 +192,17 @@
     target_count: usize,
 ) -> Vec<usize> {
     // Each step merges two clusters, so we need (n - target_count) merges
     let steps_to_take = n.saturating_sub(target_count);
 
     // Union-find helper for path compression
     #[allow(clippy::items_after_statements)]
     fn find(parent: &mut [usize], mut x: usize) -> usize {
-        while parent[x] != x {
-            parent[x] = parent[parent[x]]; // path compression
-            x = parent[x];
-        }
-        x
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     // Union-find to track cluster membership
     let mut parent: Vec<usize> = (0..2 * n).collect();
 
     // Apply merges up to our cut point
     for (step_idx, step) in dendrogram.steps().iter().enumerate() {
         if step_idx >= steps_to_take {

*** result: Success
