*** src/colbert.rs:212:21: replace >= with < in cut_dendrogram

*** mutation diff:
--- src/colbert.rs
+++ replace >= with < in cut_dendrogram
@@ -204,17 +204,17 @@
         x
     }
 
     // Union-find to track cluster membership
     let mut parent: Vec<usize> = (0..2 * n).collect();
 
     // Apply merges up to our cut point
     for (step_idx, step) in dendrogram.steps().iter().enumerate() {
-        if step_idx >= steps_to_take {
+        if step_idx < /* ~ changed by cargo-mutants ~ */ steps_to_take {
             break;
         }
         let new_cluster = n + step_idx;
         parent[step.cluster1] = new_cluster;
         parent[step.cluster2] = new_cluster;
     }
 
     // Assign final labels

*** result: Success
