*** src/colbert.rs:215:29: replace + with * in cut_dendrogram

*** mutation diff:
--- src/colbert.rs
+++ replace + with * in cut_dendrogram
@@ -207,17 +207,17 @@
     // Union-find to track cluster membership
     let mut parent: Vec<usize> = (0..2 * n).collect();
 
     // Apply merges up to our cut point
     for (step_idx, step) in dendrogram.steps().iter().enumerate() {
         if step_idx >= steps_to_take {
             break;
         }
-        let new_cluster = n + step_idx;
+        let new_cluster = n * /* ~ changed by cargo-mutants ~ */ step_idx;
         parent[step.cluster1] = new_cluster;
         parent[step.cluster2] = new_cluster;
     }
 
     // Assign final labels
     let mut label_map = std::collections::HashMap::new();
     let mut next_label = 0;
     let mut labels = vec![0; n];

*** result: Success
