*** src/colbert.rs:229:24: replace += with *= in cut_dendrogram

*** mutation diff:
--- src/colbert.rs
+++ replace += with *= in cut_dendrogram
@@ -221,17 +221,17 @@
     let mut label_map = std::collections::HashMap::new();
     let mut next_label = 0;
     let mut labels = vec![0; n];
 
     for (i, label_slot) in labels.iter_mut().enumerate() {
         let root = find(&mut parent, i);
         let label = *label_map.entry(root).or_insert_with(|| {
             let l = next_label;
-            next_label += 1;
+            next_label *= /* ~ changed by cargo-mutants ~ */ 1;
             l
         });
         *label_slot = label;
     }
 
     labels
 }

*** result: Success
