*** src/colbert.rs:244:26: replace || with && in pool_tokens_sequential

*** mutation diff:
--- src/colbert.rs
+++ replace || with && in pool_tokens_sequential
@@ -236,17 +236,17 @@
 }
 
 /// Pool tokens using simple sequential windows.
 ///
 /// Faster than clustering but less intelligent. Good for ordered sequences
 /// where adjacent tokens are likely semantically related.
 #[must_use]
 pub fn pool_tokens_sequential(tokens: &[Vec<f32>], window_size: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || window_size <= 1 {
+    if tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ window_size <= 1 {
         return tokens.to_vec();
     }
 
     tokens
         .chunks(window_size)
         .map(|chunk| {
             let dim = chunk[0].len();
             let mut pooled = vec![0.0; dim];

*** result: Success
