*** src/colbert.rs:244:41: replace <= with > in pool_tokens_sequential

*** mutation diff:
--- src/colbert.rs
+++ replace <= with > in pool_tokens_sequential
@@ -236,17 +236,17 @@
 }
 
 /// Pool tokens using simple sequential windows.
 ///
 /// Faster than clustering but less intelligent. Good for ordered sequences
 /// where adjacent tokens are likely semantically related.
 #[must_use]
 pub fn pool_tokens_sequential(tokens: &[Vec<f32>], window_size: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || window_size <= 1 {
+    if tokens.is_empty() || window_size > /* ~ changed by cargo-mutants ~ */ 1 {
         return tokens.to_vec();
     }
 
     tokens
         .chunks(window_size)
         .map(|chunk| {
             let dim = chunk[0].len();
             let mut pooled = vec![0.0; dim];

---- colbert::proptests::sequential_pool_exact_count stdout ----

thread 'colbert::proptests::sequential_pool_exact_count' (12430217) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `2`,
 right: `1` at src/colbert.rs:783.
minimal failing input: n_tokens = 2, dim = 2, window = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_high_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_high_factor' (12430224) panicked at src/colbert.rs:639:9:
assertion `left == right` failed
  left: 8
 right: 2

---- colbert::tests::test_pool_tokens_sequential stdout ----

thread 'colbert::tests::test_pool_tokens_sequential' (12430229) panicked at src/colbert.rs:601:9:
assertion `left == right` failed
  left: 4
 right: 2

failures:
    colbert::proptests::sequential_pool_exact_count
    colbert::tests::test_pool_tokens_adaptive_high_factor
    colbert::tests::test_pool_tokens_sequential

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
