*** src/colbert.rs:244:5: replace pool_tokens_sequential -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_sequential -> Vec<Vec<f32>> with vec![]
@@ -236,38 +236,17 @@
 }
 
 /// Pool tokens using simple sequential windows.
 ///
 /// Faster than clustering but less intelligent. Good for ordered sequences
 /// where adjacent tokens are likely semantically related.
 #[must_use]
 pub fn pool_tokens_sequential(tokens: &[Vec<f32>], window_size: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || window_size <= 1 {
-        return tokens.to_vec();
-    }
-
-    tokens
-        .chunks(window_size)
-        .map(|chunk| {
-            let dim = chunk[0].len();
-            let mut pooled = vec![0.0; dim];
-            for token in chunk {
-                for (k, v) in pooled.iter_mut().enumerate() {
-                    *v += token[k];
-                }
-            }
-            #[allow(clippy::cast_precision_loss)]
-            let n = chunk.len() as f32;
-            for v in &mut pooled {
-                *v /= n;
-            }
-            pooled
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pool tokens with protected indices (e.g., `[CLS]`, `[D]` markers).
 ///
 /// Protected tokens are preserved unchanged and not included in clustering.
 #[must_use]
 pub fn pool_tokens_with_protected(
     tokens: &[Vec<f32>],

---- colbert::proptests::sequential_pool_exact_count stdout ----

thread 'colbert::proptests::sequential_pool_exact_count' (12499519) panicked at src/colbert.rs:689:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/colbert.rs:762.
minimal failing input: n_tokens = 2, dim = 2, window = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::single_token_unchanged stdout ----

thread 'colbert::proptests::single_token_unchanged' (12499523) panicked at src/colbert.rs:689:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/colbert.rs:1107.
minimal failing input: dim = 2, factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_high_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_high_factor' (12499530) panicked at src/colbert.rs:618:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    colbert::proptests::sequential_pool_exact_count
    colbert::proptests::single_token_unchanged
    colbert::tests::test_pool_tokens_adaptive_high_factor
    colbert::tests::test_pool_tokens_sequential

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
