*** src/colbert.rs:244:5: replace pool_tokens_sequential -> Vec<Vec<f32>> with vec![vec![1.0]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_sequential -> Vec<Vec<f32>> with vec![vec![1.0]]
@@ -236,38 +236,17 @@
 }
 
 /// Pool tokens using simple sequential windows.
 ///
 /// Faster than clustering but less intelligent. Good for ordered sequences
 /// where adjacent tokens are likely semantically related.
 #[must_use]
 pub fn pool_tokens_sequential(tokens: &[Vec<f32>], window_size: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || window_size <= 1 {
-        return tokens.to_vec();
-    }
-
-    tokens
-        .chunks(window_size)
-        .map(|chunk| {
-            let dim = chunk[0].len();
-            let mut pooled = vec![0.0; dim];
-            for token in chunk {
-                for (k, v) in pooled.iter_mut().enumerate() {
-                    *v += token[k];
-                }
-            }
-            #[allow(clippy::cast_precision_loss)]
-            let n = chunk.len() as f32;
-            for v in &mut pooled {
-                *v /= n;
-            }
-            pooled
-        })
-        .collect()
+    vec![vec![1.0]] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pool tokens with protected indices (e.g., `[CLS]`, `[D]` markers).
 ///
 /// Protected tokens are preserved unchanged and not included in clustering.
 #[must_use]
 pub fn pool_tokens_with_protected(
     tokens: &[Vec<f32>],

---- colbert::proptests::empty_tokens_all_methods stdout ----

thread 'colbert::proptests::empty_tokens_all_methods' (12541349) panicked at src/colbert.rs:689:5:
Test failed: assertion failed: pool_tokens_sequential(&empty, factor).is_empty() at src/colbert.rs:1092.
minimal failing input: factor = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::all_pooling_methods_preserve_dim stdout ----

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12541347) panicked at src/colbert.rs:689:5:
Test failed: assertion failed: p2.iter().all(|v| v.len() == dim) at src/colbert.rs:1065.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::sequential_pool_preserves_dimension stdout ----

thread 'colbert::proptests::sequential_pool_preserves_dimension' (12541370) panicked at src/colbert.rs:689:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `2`: Dimension mismatch: expected 2, got 1 at src/colbert.rs:787.
minimal failing input: n_tokens = 2, dim = 2, window = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::empty_tokens_all_methods
    colbert::proptests::sequential_pool_exact_count
    colbert::proptests::sequential_pool_preserves_dimension
    colbert::tests::test_pool_tokens_adaptive_high_factor
    colbert::tests::test_pool_tokens_sequential
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 116 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
