*** src/colbert.rs:255:24: replace += with *= in pool_tokens_sequential

*** mutation diff:
--- src/colbert.rs
+++ replace += with *= in pool_tokens_sequential
@@ -247,17 +247,17 @@
 
     tokens
         .chunks(window_size)
         .map(|chunk| {
             let dim = chunk[0].len();
             let mut pooled = vec![0.0; dim];
             for token in chunk {
                 for (k, v) in pooled.iter_mut().enumerate() {
-                    *v += token[k];
+                    *v *= /* ~ changed by cargo-mutants ~ */ token[k];
                 }
             }
             #[allow(clippy::cast_precision_loss)]
             let n = chunk.len() as f32;
             for v in &mut pooled {
                 *v /= n;
             }
             pooled

---- colbert::tests::test_pool_tokens_sequential stdout ----

thread 'colbert::tests::test_pool_tokens_sequential' (12477452) panicked at src/colbert.rs:602:9:
assertion failed: (pooled[0][0] - 0.5).abs() < 1e-5

failures:
    colbert::tests::test_pool_tokens_sequential

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
