*** src/colbert.rs:261:20: replace /= with %= in pool_tokens_sequential

*** mutation diff:
--- src/colbert.rs
+++ replace /= with %= in pool_tokens_sequential
@@ -253,17 +253,17 @@
             for token in chunk {
                 for (k, v) in pooled.iter_mut().enumerate() {
                     *v += token[k];
                 }
             }
             #[allow(clippy::cast_precision_loss)]
             let n = chunk.len() as f32;
             for v in &mut pooled {
-                *v /= n;
+                *v %= /* ~ changed by cargo-mutants ~ */ n;
             }
             pooled
         })
         .collect()
 }
 
 /// Pool tokens with protected indices (e.g., `[CLS]`, `[D]` markers).
 ///

---- colbert::tests::test_pool_tokens_sequential stdout ----

thread 'colbert::tests::test_pool_tokens_sequential' (12455350) panicked at src/colbert.rs:602:9:
assertion failed: (pooled[0][0] - 0.5).abs() < 1e-5

failures:
    colbert::tests::test_pool_tokens_sequential

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
