*** src/colbert.rs:277:26: replace || with && in pool_tokens_with_protected

*** mutation diff:
--- src/colbert.rs
+++ replace || with && in pool_tokens_with_protected
@@ -269,17 +269,17 @@
 ///
 /// Protected tokens are preserved unchanged and not included in clustering.
 #[must_use]
 pub fn pool_tokens_with_protected(
     tokens: &[Vec<f32>],
     pool_factor: usize,
     protected_count: usize,
 ) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
+    if tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ pool_factor <= 1 {
         return tokens.to_vec();
     }
 
     let protected_count = protected_count.min(tokens.len());
     let protected = &tokens[..protected_count];
     let poolable = &tokens[protected_count..];
 
     let mut result = protected.to_vec();

*** result: Success
