*** src/colbert.rs:277:5: replace pool_tokens_with_protected -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_with_protected -> Vec<Vec<f32>> with vec![]
@@ -269,27 +269,17 @@
 ///
 /// Protected tokens are preserved unchanged and not included in clustering.
 #[must_use]
 pub fn pool_tokens_with_protected(
     tokens: &[Vec<f32>],
     pool_factor: usize,
     protected_count: usize,
 ) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
-        return tokens.to_vec();
-    }
-
-    let protected_count = protected_count.min(tokens.len());
-    let protected = &tokens[..protected_count];
-    let poolable = &tokens[protected_count..];
-
-    let mut result = protected.to_vec();
-    result.extend(pool_tokens(poolable, pool_factor));
-    result
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Adaptively choose the best pooling strategy based on pool factor.
 ///
 /// - **Factor 1-3**: Uses clustering-based pooling (greedy or hierarchical)
 /// - **Factor 4+**: Uses sequential pooling (faster, nearly as good for aggressive compression)
 ///
 /// This is a convenience function that picks reasonable defaults. For full control,

---- colbert::proptests::protected_tokens_preserved stdout ----

thread 'colbert::proptests::protected_tokens_preserved' (12574650) panicked at src/colbert.rs:700:5:
Test failed: Should have at least protected tokens at src/colbert.rs:824.
minimal failing input: n_tokens = 3, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_with_protected stdout ----

thread 'colbert::tests::test_pool_tokens_with_protected' (12574672) panicked at src/colbert.rs:605:26:
index out of bounds: the len is 0 but the index is 0

failures:
    colbert::proptests::protected_tokens_preserved
    colbert::tests::test_pool_tokens_with_protected

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
