*** src/colbert.rs:320:41: replace <= with > in pool_tokens_adaptive

*** mutation diff:
--- src/colbert.rs
+++ replace <= with > in pool_tokens_adaptive
@@ -312,17 +312,17 @@
 /// assert_eq!(pooled_2.len(), 2);
 ///
 /// // Factor 4: uses sequential (speed matters more at aggressive compression)
 /// let pooled_4 = colbert::pool_tokens_adaptive(&tokens, 4);
 /// assert_eq!(pooled_4.len(), 1);
 /// ```
 #[must_use]
 pub fn pool_tokens_adaptive(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
+    if tokens.is_empty() || pool_factor > /* ~ changed by cargo-mutants ~ */ 1 {
         return tokens.to_vec();
     }
 
     // For aggressive pooling (factor 4+), sequential is nearly as good and much faster
     // For moderate pooling (factor 2-3), clustering preserves quality better
     if pool_factor >= 4 {
         pool_tokens_sequential(tokens, pool_factor)
     } else {

---- colbert::proptests::adaptive_uses_clustering_for_low_factors stdout ----

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12485846) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `4`,
 right: `2` at src/colbert.rs:1052.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::adaptive_uses_sequential_for_high_factors stdout ----

thread 'colbert::proptests::adaptive_uses_sequential_for_high_factors' (12485847) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `8`,
 right: `2` at src/colbert.rs:1067.
minimal failing input: n_tokens = 8, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_high_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_high_factor' (12485876) panicked at src/colbert.rs:639:9:
assertion `left == right` failed
  left: 8
 right: 2

failures:
    colbert::proptests::adaptive_uses_clustering_for_low_factors
    colbert::proptests::adaptive_uses_sequential_for_high_factors
    colbert::tests::test_pool_tokens_adaptive_high_factor
    colbert::tests::test_pool_tokens_adaptive_low_factor

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
