*** src/colbert.rs:320:5: replace pool_tokens_adaptive -> Vec<Vec<f32>> with vec![vec![1.0]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens_adaptive -> Vec<Vec<f32>> with vec![vec![1.0]]
@@ -312,27 +312,17 @@
 /// assert_eq!(pooled_2.len(), 2);
 ///
 /// // Factor 4: uses sequential (speed matters more at aggressive compression)
 /// let pooled_4 = colbert::pool_tokens_adaptive(&tokens, 4);
 /// assert_eq!(pooled_4.len(), 1);
 /// ```
 #[must_use]
 pub fn pool_tokens_adaptive(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
-        return tokens.to_vec();
-    }
-
-    // For aggressive pooling (factor 4+), sequential is nearly as good and much faster
-    // For moderate pooling (factor 2-3), clustering preserves quality better
-    if pool_factor >= 4 {
-        pool_tokens_sequential(tokens, pool_factor)
-    } else {
-        pool_tokens(tokens, pool_factor)
-    }
+    vec![vec![1.0]] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(not(feature = "hierarchical"))]
 fn cluster_similarity(tokens: &[Vec<f32>], c1: &[usize], c2: &[usize]) -> f32 {
     let centroid1 = mean_pool(tokens, c1);
     let centroid2 = mean_pool(tokens, c2);
     simd::cosine(&centroid1, &centroid2)
 }

---- colbert::proptests::adaptive_uses_clustering_for_low_factors stdout ----

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12432743) panicked at src/colbert.rs:700:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`,
 right: `2` at src/colbert.rs:1042.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::adaptive_uses_sequential_for_high_factors stdout ----

thread 'colbert::proptests::adaptive_uses_sequential_for_high_factors' (12432744) panicked at src/colbert.rs:700:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`,
 right: `2` at src/colbert.rs:1057.
minimal failing input: n_tokens = 8, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::empty_tokens_all_methods stdout ----

thread 'colbert::proptests::empty_tokens_all_methods' (12432747) panicked at src/colbert.rs:700:5:
Test failed: assertion failed: pool_tokens_adaptive(&empty, factor).is_empty() at src/colbert.rs:1104.
minimal failing input: factor = 1
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::adaptive_uses_clustering_for_low_factors
    colbert::proptests::adaptive_uses_sequential_for_high_factors
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::empty_tokens_all_methods
    colbert::tests::test_pool_tokens_adaptive_empty
    colbert::tests::test_pool_tokens_adaptive_factor_one
    colbert::tests::test_pool_tokens_adaptive_high_factor
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 114 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
