*** src/colbert.rs:326:20: replace >= with < in pool_tokens_adaptive

*** mutation diff:
--- src/colbert.rs
+++ replace >= with < in pool_tokens_adaptive
@@ -318,17 +318,17 @@
 #[must_use]
 pub fn pool_tokens_adaptive(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
     if tokens.is_empty() || pool_factor <= 1 {
         return tokens.to_vec();
     }
 
     // For aggressive pooling (factor 4+), sequential is nearly as good and much faster
     // For moderate pooling (factor 2-3), clustering preserves quality better
-    if pool_factor >= 4 {
+    if pool_factor < /* ~ changed by cargo-mutants ~ */ 4 {
         pool_tokens_sequential(tokens, pool_factor)
     } else {
         pool_tokens(tokens, pool_factor)
     }
 }
 
 #[cfg(not(feature = "hierarchical"))]
 fn cluster_similarity(tokens: &[Vec<f32>], c1: &[usize], c2: &[usize]) -> f32 {

---- colbert::proptests::adaptive_uses_clustering_for_low_factors stdout ----

thread 'colbert::proptests::adaptive_uses_clustering_for_low_factors' (12542539) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `5`,
 right: `4` at src/colbert.rs:1052.
minimal failing input: n_tokens = 9, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::adaptive_uses_sequential_for_high_factors stdout ----

thread 'colbert::proptests::adaptive_uses_sequential_for_high_factors' (12542540) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `[0.0, 0.09983342, 0.19866933, 0.29552022]`,
 right: `[0.5097034, 0.58153605, 0.64755815, 0.70711005]` at src/colbert.rs:1069.
minimal failing input: n_tokens = 8, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::adaptive_uses_clustering_for_low_factors
    colbert::proptests::adaptive_uses_sequential_for_high_factors

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
