*** src/colbert.rs:335:5: replace cluster_similarity -> f32 with -1.0

*** mutation diff:
--- src/colbert.rs
+++ replace cluster_similarity -> f32 with -1.0
@@ -327,19 +327,17 @@
         pool_tokens_sequential(tokens, pool_factor)
     } else {
         pool_tokens(tokens, pool_factor)
     }
 }
 
 #[cfg(not(feature = "hierarchical"))]
 fn cluster_similarity(tokens: &[Vec<f32>], c1: &[usize], c2: &[usize]) -> f32 {
-    let centroid1 = mean_pool(tokens, c1);
-    let centroid2 = mean_pool(tokens, c2);
-    simd::cosine(&centroid1, &centroid2)
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn mean_pool(tokens: &[Vec<f32>], indices: &[usize]) -> Vec<f32> {
     if indices.is_empty() {
         return vec![];
     }
     let dim = tokens[indices[0]].len();
     let mut pooled = vec![0.0; dim];

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12487985) panicked at src/colbert.rs:708:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0.9070101 at src/colbert.rs:947.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
