*** src/colbert.rs:341:5: replace mean_pool -> Vec<f32> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace mean_pool -> Vec<f32> with vec![]
@@ -333,32 +333,17 @@
 #[cfg(not(feature = "hierarchical"))]
 fn cluster_similarity(tokens: &[Vec<f32>], c1: &[usize], c2: &[usize]) -> f32 {
     let centroid1 = mean_pool(tokens, c1);
     let centroid2 = mean_pool(tokens, c2);
     simd::cosine(&centroid1, &centroid2)
 }
 
 fn mean_pool(tokens: &[Vec<f32>], indices: &[usize]) -> Vec<f32> {
-    if indices.is_empty() {
-        return vec![];
-    }
-    let dim = tokens[indices[0]].len();
-    let mut pooled = vec![0.0; dim];
-    for &idx in indices {
-        for (k, v) in pooled.iter_mut().enumerate() {
-            *v += tokens[idx][k];
-        }
-    }
-    #[allow(clippy::cast_precision_loss)]
-    let n = indices.len() as f32;
-    for v in &mut pooled {
-        *v /= n;
-    }
-    pooled
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Ranking & Refinement
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Rank documents by `MaxSim` score against query tokens.
 ///

---- colbert::proptests::pool_preserves_dimension stdout ----

thread 'colbert::proptests::pool_preserves_dimension' (12461009) panicked at src/colbert.rs:695:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`, 
 right: `2`: Dimension mismatch: expected 2, got 0 at src/colbert.rs:780.
minimal failing input: n_tokens = 2, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12461008) panicked at src/colbert.rs:695:5:
Test failed: Score dropped too much: 8.24 -> 0 at src/colbert.rs:846.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12461010) panicked at src/colbert.rs:695:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:899.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pooling_idempotent_at_target
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 115 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
