*** src/colbert.rs:341:5: replace mean_pool -> Vec<f32> with vec![1.0]

*** mutation diff:
--- src/colbert.rs
+++ replace mean_pool -> Vec<f32> with vec![1.0]
@@ -333,32 +333,17 @@
 #[cfg(not(feature = "hierarchical"))]
 fn cluster_similarity(tokens: &[Vec<f32>], c1: &[usize], c2: &[usize]) -> f32 {
     let centroid1 = mean_pool(tokens, c1);
     let centroid2 = mean_pool(tokens, c2);
     simd::cosine(&centroid1, &centroid2)
 }
 
 fn mean_pool(tokens: &[Vec<f32>], indices: &[usize]) -> Vec<f32> {
-    if indices.is_empty() {
-        return vec![];
-    }
-    let dim = tokens[indices[0]].len();
-    let mut pooled = vec![0.0; dim];
-    for &idx in indices {
-        for (k, v) in pooled.iter_mut().enumerate() {
-            *v += tokens[idx][k];
-        }
-    }
-    #[allow(clippy::cast_precision_loss)]
-    let n = indices.len() as f32;
-    for v in &mut pooled {
-        *v /= n;
-    }
-    pooled
+    vec![1.0] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Ranking & Refinement
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Rank documents by `MaxSim` score against query tokens.
 ///

---- colbert::proptests::all_pooling_methods_preserve_dim stdout ----

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12536875) panicked at src/colbert.rs:695:5:
Test failed: assertion failed: p1.iter().all(|v| v.len() == dim) at src/colbert.rs:1070.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12536885) panicked at src/colbert.rs:695:5:
Test failed: Score dropped too much: 8.24 -> 1.3000001 at src/colbert.rs:846.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12536876) panicked at src/colbert.rs:695:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:934.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 118 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
