*** src/colbert.rs:348:16: replace += with *= in mean_pool

*** mutation diff:
--- src/colbert.rs
+++ replace += with *= in mean_pool
@@ -340,17 +340,17 @@
 fn mean_pool(tokens: &[Vec<f32>], indices: &[usize]) -> Vec<f32> {
     if indices.is_empty() {
         return vec![];
     }
     let dim = tokens[indices[0]].len();
     let mut pooled = vec![0.0; dim];
     for &idx in indices {
         for (k, v) in pooled.iter_mut().enumerate() {
-            *v += tokens[idx][k];
+            *v *= /* ~ changed by cargo-mutants ~ */ tokens[idx][k];
         }
     }
     #[allow(clippy::cast_precision_loss)]
     let n = indices.len() as f32;
     for v in &mut pooled {
         *v /= n;
     }
     pooled

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12430002) panicked at src/colbert.rs:710:5:
Test failed: Score dropped too much: 8.24 -> 0 at src/colbert.rs:861.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12430004) panicked at src/colbert.rs:710:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:914.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12430006) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = 0 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pooling_idempotent_at_target
    colbert::tests::test_maxsim_with_pooled_tokens

test result: FAILED. 119 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
