*** src/colbert.rs:348:16: replace += with -= in mean_pool

*** mutation diff:
--- src/colbert.rs
+++ replace += with -= in mean_pool
@@ -340,17 +340,17 @@
 fn mean_pool(tokens: &[Vec<f32>], indices: &[usize]) -> Vec<f32> {
     if indices.is_empty() {
         return vec![];
     }
     let dim = tokens[indices[0]].len();
     let mut pooled = vec![0.0; dim];
     for &idx in indices {
         for (k, v) in pooled.iter_mut().enumerate() {
-            *v += tokens[idx][k];
+            *v -= /* ~ changed by cargo-mutants ~ */ tokens[idx][k];
         }
     }
     #[allow(clippy::cast_precision_loss)]
     let n = indices.len() as f32;
     for v in &mut pooled {
         *v /= n;
     }
     pooled

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12529613) panicked at src/colbert.rs:710:5:
Test failed: Score dropped too much: 8.24 -> -1.76 at src/colbert.rs:861.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12529607) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0.7666475 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_maxsim_with_pooled_tokens stdout ----

thread 'colbert::tests::test_maxsim_with_pooled_tokens' (12529631) panicked at src/colbert.rs:695:9:
assertion failed: score_pooled > 0.0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::tests::test_maxsim_with_pooled_tokens

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
