*** src/colbert.rs:354:12: replace /= with *= in mean_pool

*** mutation diff:
--- src/colbert.rs
+++ replace /= with *= in mean_pool
@@ -346,17 +346,17 @@
     for &idx in indices {
         for (k, v) in pooled.iter_mut().enumerate() {
             *v += tokens[idx][k];
         }
     }
     #[allow(clippy::cast_precision_loss)]
     let n = indices.len() as f32;
     for v in &mut pooled {
-        *v /= n;
+        *v *= /* ~ changed by cargo-mutants ~ */ n;
     }
     pooled
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Ranking & Refinement
 // ─────────────────────────────────────────────────────────────────────────────

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12553190) panicked at src/colbert.rs:710:5:
Test failed: Pooled norm 14.198645 too large vs original 4.9877143 at src/colbert.rs:918.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::pool_preserves_vector_mass

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
