*** src/colbert.rs:368:5: replace rank -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace rank -> Vec<(I, f32)> with vec![]
@@ -360,17 +360,17 @@
 // Ranking & Refinement
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Rank documents by `MaxSim` score against query tokens.
 ///
 /// Returns documents sorted by descending `MaxSim` score.
 #[must_use]
 pub fn rank<I: Clone>(query: &[Vec<f32>], docs: &[(I, Vec<Vec<f32>>)]) -> Vec<(I, f32)> {
-    rank_with_top_k(query, docs, None)
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Rank documents with optional `top_k` limit.
 #[must_use]
 pub fn rank_with_top_k<I: Clone>(
     query: &[Vec<f32>],
     docs: &[(I, Vec<Vec<f32>>)],
     top_k: Option<usize>,

---- colbert::proptests::rank_preserves_doc_count stdout ----

thread 'colbert::proptests::rank_preserves_doc_count' (12469945) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/colbert.rs:726.
minimal failing input: n_docs = 1, n_query_tok = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_rank_empty_docs stdout ----

thread 'colbert::tests::test_rank_empty_docs' (12469972) panicked at src/colbert.rs:508:26:
index out of bounds: the len is 0 but the index is 0

---- colbert::tests::test_rank_empty_query stdout ----

thread 'colbert::tests::test_rank_empty_query' (12469973) panicked at src/colbert.rs:498:26:
index out of bounds: the len is 0 but the index is 0

failures:
    colbert::proptests::rank_preserves_doc_count
    colbert::tests::test_rank
    colbert::tests::test_rank_empty_docs
    colbert::tests::test_rank_empty_query

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
