*** src/colbert.rs:378:5: replace rank_with_top_k -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace rank_with_top_k -> Vec<(I, f32)> with vec![]
@@ -370,34 +370,17 @@
 
 /// Rank documents with optional `top_k` limit.
 #[must_use]
 pub fn rank_with_top_k<I: Clone>(
     query: &[Vec<f32>],
     docs: &[(I, Vec<Vec<f32>>)],
     top_k: Option<usize>,
 ) -> Vec<(I, f32)> {
-    let query_refs = crate::as_slices(query);
-
-    let mut results: Vec<(I, f32)> = docs
-        .iter()
-        .map(|(id, doc_tokens)| {
-            let doc_refs = crate::as_slices(doc_tokens);
-            let score = simd::maxsim(&query_refs, &doc_refs);
-            (id.clone(), score)
-        })
-        .collect();
-
-    crate::sort_scored_desc(&mut results);
-
-    if let Some(k) = top_k {
-        results.truncate(k);
-    }
-
-    results
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Refine candidates using `MaxSim`, blending with original scores.
 ///
 /// # Arguments
 ///
 /// * `candidates` - Initial retrieval results (id, score)
 /// * `query` - Query token embeddings

---- colbert::proptests::rank_preserves_doc_count stdout ----

thread 'colbert::proptests::rank_preserves_doc_count' (12544888) panicked at src/colbert.rs:693:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/colbert.rs:709.
minimal failing input: n_docs = 1, n_query_tok = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_rank_empty_query stdout ----

thread 'colbert::tests::test_rank_empty_query' (12544916) panicked at src/colbert.rs:481:26:
index out of bounds: the len is 0 but the index is 0

---- colbert::tests::test_rank stdout ----

thread 'colbert::tests::test_rank' (12544914) panicked at src/colbert.rs:459:26:
index out of bounds: the len is 0 but the index is 0

failures:
    colbert::proptests::rank_preserves_doc_count
    colbert::tests::test_rank
    colbert::tests::test_rank_empty_docs
    colbert::tests::test_rank_empty_query
    colbert::tests::test_rank_with_top_k

test result: FAILED. 119 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.54s

*** result: Failure(101)
