*** src/colbert.rs:417:5: replace refine -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace refine -> Vec<(I, f32)> with vec![]
@@ -409,22 +409,17 @@
 /// Candidates not found in `docs` are silently dropped.
 #[must_use]
 pub fn refine<I: Clone + Eq + std::hash::Hash>(
     candidates: &[(I, f32)],
     query: &[Vec<f32>],
     docs: &[(I, Vec<Vec<f32>>)],
     alpha: f32,
 ) -> Vec<(I, f32)> {
-    refine_with_config(
-        candidates,
-        query,
-        docs,
-        RefineConfig::default().with_alpha(alpha),
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Refine with full configuration.
 #[must_use]
 pub fn refine_with_config<I: Clone + Eq + std::hash::Hash>(
     candidates: &[(I, f32)],
     query: &[Vec<f32>],
     docs: &[(I, Vec<Vec<f32>>)],

---- colbert::tests::test_nan_score_handling stdout ----

thread 'colbert::tests::test_nan_score_handling' (12454246) panicked at src/colbert.rs:557:9:
assertion `left == right` failed
  left: 0
 right: 2

---- colbert::tests::test_refine stdout ----

thread 'colbert::tests::test_refine' (12454261) panicked at src/colbert.rs:514:27:
index out of bounds: the len is 0 but the index is 0

---- colbert::tests::test_refine_missing_doc stdout ----

thread 'colbert::tests::test_refine_missing_doc' (12454262) panicked at src/colbert.rs:546:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    colbert::tests::test_nan_score_handling
    colbert::tests::test_refine
    colbert::tests::test_refine_missing_doc

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
