*** src/colbert.rs:433:5: replace refine_with_config -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace refine_with_config -> Vec<(I, f32)> with vec![]
@@ -425,40 +425,17 @@
 /// Refine with full configuration.
 #[must_use]
 pub fn refine_with_config<I: Clone + Eq + std::hash::Hash>(
     candidates: &[(I, f32)],
     query: &[Vec<f32>],
     docs: &[(I, Vec<Vec<f32>>)],
     config: RefineConfig,
 ) -> Vec<(I, f32)> {
-    use std::collections::HashMap;
-
-    let doc_map: HashMap<&I, &Vec<Vec<f32>>> = docs.iter().map(|(id, toks)| (id, toks)).collect();
-    let query_refs = crate::as_slices(query);
-    let alpha = config.alpha;
-
-    let mut results: Vec<(I, f32)> = candidates
-        .iter()
-        .filter_map(|(id, orig_score)| {
-            let doc_tokens = doc_map.get(id)?;
-            let doc_refs = crate::as_slices(doc_tokens);
-            let maxsim_score = simd::maxsim(&query_refs, &doc_refs);
-            let blended = (1.0 - alpha).mul_add(maxsim_score, alpha * orig_score);
-            Some((id.clone(), blended))
-        })
-        .collect();
-
-    crate::sort_scored_desc(&mut results);
-
-    if let Some(k) = config.top_k {
-        results.truncate(k);
-    }
-
-    results
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]
 mod tests {

---- colbert::tests::test_nan_score_handling stdout ----

thread 'colbert::tests::test_nan_score_handling' (12566078) panicked at src/colbert.rs:539:9:
assertion `left == right` failed
  left: 0
 right: 2

---- colbert::tests::test_refine stdout ----

thread 'colbert::tests::test_refine' (12566094) panicked at src/colbert.rs:496:27:
index out of bounds: the len is 0 but the index is 0

---- colbert::tests::test_refine_missing_doc stdout ----

thread 'colbert::tests::test_refine_missing_doc' (12566095) panicked at src/colbert.rs:528:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    colbert::tests::test_nan_score_handling
    colbert::tests::test_refine
    colbert::tests::test_refine_missing_doc
    colbert::tests::test_refine_with_config_top_k

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
