*** src/colbert.rs:445:32: replace - with + in refine_with_config

*** mutation diff:
--- src/colbert.rs
+++ replace - with + in refine_with_config
@@ -437,17 +437,17 @@
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig_score)| {
             let doc_tokens = doc_map.get(id)?;
             let doc_refs = crate::as_slices(doc_tokens);
             let maxsim_score = simd::maxsim(&query_refs, &doc_refs);
-            let blended = (1.0 - alpha).mul_add(maxsim_score, alpha * orig_score);
+            let blended = (1.0 + /* ~ changed by cargo-mutants ~ */ alpha).mul_add(maxsim_score, alpha * orig_score);
             Some((id.clone(), blended))
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
 
     if let Some(k) = config.top_k {
         results.truncate(k);

---- colbert::tests::test_refine stdout ----

thread 'colbert::tests::test_refine' (12490228) panicked at src/colbert.rs:522:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    colbert::tests::test_refine

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
