*** src/colbert.rs:445:69: replace * with / in refine_with_config

*** mutation diff:
--- src/colbert.rs
+++ replace * with / in refine_with_config
@@ -437,17 +437,17 @@
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig_score)| {
             let doc_tokens = doc_map.get(id)?;
             let doc_refs = crate::as_slices(doc_tokens);
             let maxsim_score = simd::maxsim(&query_refs, &doc_refs);
-            let blended = (1.0 - alpha).mul_add(maxsim_score, alpha * orig_score);
+            let blended = (1.0 - alpha).mul_add(maxsim_score, alpha / /* ~ changed by cargo-mutants ~ */ orig_score);
             Some((id.clone(), blended))
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
 
     if let Some(k) = config.top_k {
         results.truncate(k);

---- colbert::proptests::refine_alpha_one_preserves_order stdout ----

thread 'colbert::proptests::refine_alpha_one_preserves_order' (12538521) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `0`: Order not preserved at index 0 at src/colbert.rs:882.
minimal failing input: n_cand = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_refine stdout ----

thread 'colbert::tests::test_refine' (12538543) panicked at src/colbert.rs:522:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    colbert::proptests::refine_alpha_one_preserves_order
    colbert::tests::test_refine

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
