*** src/colbert.rs:81:26: replace || with && in pool_tokens

*** mutation diff:
--- src/colbert.rs
+++ replace || with && in pool_tokens
@@ -73,17 +73,17 @@
 /// - **With `hierarchical` feature**: Ward's method via kodama (O(n² log n), better quality)
 ///
 /// # Arguments
 ///
 /// * `tokens` - Document token embeddings (assumed L2-normalized for `ColBERT`)
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
+    if tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ pool_factor <= 1 {
         return tokens.to_vec();
     }
 
     let n = tokens.len();
     let target_count = (n / pool_factor).max(1);
 
     if n <= target_count {
         return tokens.to_vec();

*** result: Success
