*** src/colbert.rs:81:5: replace pool_tokens -> Vec<Vec<f32>> with vec![vec![-1.0]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens -> Vec<Vec<f32>> with vec![vec![-1.0]]
@@ -73,36 +73,17 @@
 /// - **With `hierarchical` feature**: Ward's method via kodama (O(n² log n), better quality)
 ///
 /// # Arguments
 ///
 /// * `tokens` - Document token embeddings (assumed L2-normalized for `ColBERT`)
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
-        return tokens.to_vec();
-    }
-
-    let n = tokens.len();
-    let target_count = (n / pool_factor).max(1);
-
-    if n <= target_count {
-        return tokens.to_vec();
-    }
-
-    #[cfg(feature = "hierarchical")]
-    {
-        pool_tokens_hierarchical(tokens, target_count)
-    }
-
-    #[cfg(not(feature = "hierarchical"))]
-    {
-        pool_tokens_greedy(tokens, target_count)
-    }
+    vec![vec![-1.0]] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
     let n = tokens.len();
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12446160) panicked at src/colbert.rs:691:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:930.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_factor_one_identity stdout ----

thread 'colbert::proptests::pool_factor_one_identity' (12446165) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `2`: Factor 1 should preserve count at src/colbert.rs:801.
minimal failing input: n_tokens = 2, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::all_pooling_methods_preserve_dim stdout ----

thread 'colbert::proptests::all_pooling_methods_preserve_dim' (12446159) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: p1.iter().all(|v| v.len() == dim) at src/colbert.rs:1066.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::empty_tokens_all_methods
    colbert::proptests::pool_factor_one_identity
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_empty
    colbert::tests::test_pool_tokens_factor_one
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 112 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
