*** src/colbert.rs:81:5: replace pool_tokens -> Vec<Vec<f32>> with vec![vec![1.0]]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens -> Vec<Vec<f32>> with vec![vec![1.0]]
@@ -73,36 +73,17 @@
 /// - **With `hierarchical` feature**: Ward's method via kodama (O(n² log n), better quality)
 ///
 /// # Arguments
 ///
 /// * `tokens` - Document token embeddings (assumed L2-normalized for `ColBERT`)
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
-        return tokens.to_vec();
-    }
-
-    let n = tokens.len();
-    let target_count = (n / pool_factor).max(1);
-
-    if n <= target_count {
-        return tokens.to_vec();
-    }
-
-    #[cfg(feature = "hierarchical")]
-    {
-        pool_tokens_hierarchical(tokens, target_count)
-    }
-
-    #[cfg(not(feature = "hierarchical"))]
-    {
-        pool_tokens_greedy(tokens, target_count)
-    }
+    vec![vec![1.0]] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
     let n = tokens.len();
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();

---- colbert::proptests::pool_preserves_dimension stdout ----

thread 'colbert::proptests::pool_preserves_dimension' (12529371) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: `(left == right)` 
  left: `1`, 
 right: `2`: Dimension mismatch: expected 2, got 1 at src/colbert.rs:776.
minimal failing input: n_tokens = 2, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::empty_tokens_all_methods stdout ----

thread 'colbert::proptests::empty_tokens_all_methods' (12529365) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: pool_tokens(&empty, factor).is_empty() at src/colbert.rs:1093.
minimal failing input: factor = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12529364) panicked at src/colbert.rs:691:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:930.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::all_pooling_methods_preserve_dim
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::empty_tokens_all_methods
    colbert::proptests::pool_factor_one_identity
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_dimension
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_empty
    colbert::tests::test_pool_tokens_factor_one
    colbert::tests::test_pooling_methods_produce_same_dimensions
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 113 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
