*** src/colbert.rs:81:5: replace pool_tokens -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/colbert.rs
+++ replace pool_tokens -> Vec<Vec<f32>> with vec![]
@@ -73,36 +73,17 @@
 /// - **With `hierarchical` feature**: Ward's method via kodama (O(n² log n), better quality)
 ///
 /// # Arguments
 ///
 /// * `tokens` - Document token embeddings (assumed L2-normalized for `ColBERT`)
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
-    if tokens.is_empty() || pool_factor <= 1 {
-        return tokens.to_vec();
-    }
-
-    let n = tokens.len();
-    let target_count = (n / pool_factor).max(1);
-
-    if n <= target_count {
-        return tokens.to_vec();
-    }
-
-    #[cfg(feature = "hierarchical")]
-    {
-        pool_tokens_hierarchical(tokens, target_count)
-    }
-
-    #[cfg(not(feature = "hierarchical"))]
-    {
-        pool_tokens_greedy(tokens, target_count)
-    }
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Greedy agglomerative clustering (default, O(n³)).
 #[cfg(not(feature = "hierarchical"))]
 fn pool_tokens_greedy(tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
     let n = tokens.len();
     let mut clusters: Vec<Vec<usize>> = (0..n).map(|i| vec![i]).collect();

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12572533) panicked at src/colbert.rs:691:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = -inf at src/colbert.rs:930.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_factor_one_identity stdout ----

thread 'colbert::proptests::pool_factor_one_identity' (12572538) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`, 
 right: `1`: Factor 1 should preserve count at src/colbert.rs:801.
minimal failing input: n_tokens = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_reduces_count stdout ----

thread 'colbert::proptests::pool_reduces_count' (12572542) panicked at src/colbert.rs:691:5:
Test failed: assertion failed: !pooled.is_empty() at src/colbert.rs:753.
minimal failing input: n_tokens = 4, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_factor_one_identity
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pool_reduces_count
    colbert::proptests::single_token_unchanged
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_factor_one
    colbert::tests::test_pool_tokens_reduces_count
    colbert::tests::test_pool_tokens_with_protected

test result: FAILED. 113 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
