*** src/colbert.rs:86:27: replace / with * in pool_tokens

*** mutation diff:
--- src/colbert.rs
+++ replace / with * in pool_tokens
@@ -78,17 +78,17 @@
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
     if tokens.is_empty() || pool_factor <= 1 {
         return tokens.to_vec();
     }
 
     let n = tokens.len();
-    let target_count = (n / pool_factor).max(1);
+    let target_count = (n * /* ~ changed by cargo-mutants ~ */ pool_factor).max(1);
 
     if n <= target_count {
         return tokens.to_vec();
     }
 
     #[cfg(feature = "hierarchical")]
     {
         pool_tokens_hierarchical(tokens, target_count)

---- colbert::proptests::pool_reduces_count stdout ----

thread 'colbert::proptests::pool_reduces_count' (12448964) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: pooled.len() <= expected_max + 1 at src/colbert.rs:771.
minimal failing input: n_tokens = 4, dim = 2, pool_factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_low_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_low_factor' (12448980) panicked at src/colbert.rs:629:9:
assertion `left == right` failed
  left: 4
 right: 2

---- colbert::tests::test_pool_tokens_reduces_count stdout ----

thread 'colbert::tests::test_pool_tokens_reduces_count' (12448983) panicked at src/colbert.rs:588:9:
assertion failed: pooled.len() <= 2

failures:
    colbert::proptests::pool_reduces_count
    colbert::tests::test_pool_tokens_adaptive_low_factor
    colbert::tests::test_pool_tokens_reduces_count

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.19s

*** result: Failure(101)
