*** src/colbert.rs:86:27: replace / with % in pool_tokens

*** mutation diff:
--- src/colbert.rs
+++ replace / with % in pool_tokens
@@ -78,17 +78,17 @@
 /// * `pool_factor` - Target compression ratio (2 = 50% reduction, 3 = 66%, etc.)
 #[must_use]
 pub fn pool_tokens(tokens: &[Vec<f32>], pool_factor: usize) -> Vec<Vec<f32>> {
     if tokens.is_empty() || pool_factor <= 1 {
         return tokens.to_vec();
     }
 
     let n = tokens.len();
-    let target_count = (n / pool_factor).max(1);
+    let target_count = (n % /* ~ changed by cargo-mutants ~ */ pool_factor).max(1);
 
     if n <= target_count {
         return tokens.to_vec();
     }
 
     #[cfg(feature = "hierarchical")]
     {
         pool_tokens_hierarchical(tokens, target_count)

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12482049) panicked at src/colbert.rs:710:5:
Test failed: Score dropped too much: 8.24 -> 3.3799999 at src/colbert.rs:861.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_pool_tokens_adaptive_low_factor stdout ----

thread 'colbert::tests::test_pool_tokens_adaptive_low_factor' (12482071) panicked at src/colbert.rs:629:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    colbert::proptests::pool_maintains_score_quality
    colbert::tests::test_pool_tokens_adaptive_low_factor

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
