*** src/crossencoder.rs:35:9: replace CrossEncoderModel::score -> Score with Default::default()

*** mutation diff:
--- src/crossencoder.rs
+++ replace CrossEncoderModel::score -> Score with Default::default()
@@ -27,17 +27,17 @@
 pub trait CrossEncoderModel {
     /// Score a batch of query-document pairs.
     ///
     /// Returns relevance scores (higher = more relevant).
     fn score_batch(&self, query: &str, documents: &[&str]) -> Vec<Score>;
 
     /// Score a single query-document pair.
     fn score(&self, query: &str, document: &str) -> Score {
-        self.score_batch(query, &[document]).pop().unwrap_or(0.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Rerank candidates by cross-encoder score (descending).
 #[must_use]
 pub fn rerank<I: Clone, M: CrossEncoderModel>(
     model: &M,
     query: &str,

*** result: Success
