*** src/crossencoder.rs:46:5: replace rerank -> Vec<(I, Score)> with vec![]

*** mutation diff:
--- src/crossencoder.rs
+++ replace rerank -> Vec<(I, Score)> with vec![]
@@ -38,27 +38,17 @@
 
 /// Rerank candidates by cross-encoder score (descending).
 #[must_use]
 pub fn rerank<I: Clone, M: CrossEncoderModel>(
     model: &M,
     query: &str,
     candidates: &[(I, &str)],
 ) -> Vec<(I, Score)> {
-    let docs: Vec<&str> = candidates.iter().map(|(_, text)| *text).collect();
-    let scores = model.score_batch(query, &docs);
-
-    let mut results: Vec<(I, Score)> = candidates
-        .iter()
-        .zip(scores)
-        .map(|((id, _), score)| (id.clone(), score))
-        .collect();
-
-    crate::sort_scored_desc(&mut results);
-    results
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Blend cross-encoder scores with original scores.
 ///
 /// CE scores normalized to \[0,1\]. `alpha`: 0 = all CE, 1 = all original.
 #[must_use]
 pub fn refine<I: Clone, M: CrossEncoderModel>(
     model: &M,

---- crossencoder::proptests::rerank_preserves_count stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-q9Nsw0.tmp/proptest-regressions/crossencoder.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc bb625f2e442ab6dd18c3b4a96fd44c2b3d259d62eb772deec681f8988c19d0a6

thread 'crossencoder::proptests::rerank_preserves_count' (12508012) panicked at src/crossencoder.rs:186:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/crossencoder.rs:196.
minimal failing input: n = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- crossencoder::tests::test_rerank stdout ----

thread 'crossencoder::tests::test_rerank' (12508018) panicked at src/crossencoder.rs:112:26:
index out of bounds: the len is 0 but the index is 0

failures:
    crossencoder::proptests::rerank_preserves_count
    crossencoder::tests::test_rerank

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
