*** src/crossencoder.rs:69:5: replace refine -> Vec<(I, Score)> with vec![]

*** mutation diff:
--- src/crossencoder.rs
+++ replace refine -> Vec<(I, Score)> with vec![]
@@ -61,44 +61,17 @@
 /// CE scores normalized to \[0,1\]. `alpha`: 0 = all CE, 1 = all original.
 #[must_use]
 pub fn refine<I: Clone, M: CrossEncoderModel>(
     model: &M,
     query: &str,
     candidates: &[(I, &str, f32)], // (id, text, original_score)
     alpha: f32,
 ) -> Vec<(I, Score)> {
-    if candidates.is_empty() {
-        return Vec::new();
-    }
-
-    let docs: Vec<&str> = candidates.iter().map(|(_, text, _)| *text).collect();
-    let ce_scores = model.score_batch(query, &docs);
-
-    // Normalize CE scores to [0, 1]
-    let (min_ce, max_ce) = ce_scores
-        .iter()
-        .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
-            (lo.min(s), hi.max(s))
-        });
-    let range = (max_ce - min_ce).max(1e-9);
-
-    let mut results: Vec<(I, Score)> = candidates
-        .iter()
-        .zip(ce_scores)
-        .map(|((id, _, orig), ce)| {
-            let ce_norm = (ce - min_ce) / range;
-            // Use mul_add for better precision
-            let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
-            (id.clone(), blended)
-        })
-        .collect();
-
-    crate::sort_scored_desc(&mut results);
-    results
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     struct MockEncoder;

---- crossencoder::tests::test_nan_score_handling stdout ----

thread 'crossencoder::tests::test_nan_score_handling' (12546856) panicked at src/crossencoder.rs:151:9:
assertion `left == right` failed
  left: 0
 right: 2

---- crossencoder::proptests::refine_preserves_count stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-2ZFznG.tmp/proptest-regressions/crossencoder.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc 1cce35f3299b03bb6203ec53d1e17368f7e8a1d038c45e220cddafafa532eda1

thread 'crossencoder::proptests::refine_preserves_count' (12546852) panicked at src/crossencoder.rs:169:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/crossencoder.rs:210.
minimal failing input: n = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- crossencoder::tests::test_refine_single_candidate stdout ----

thread 'crossencoder::tests::test_refine_single_candidate' (12546860) panicked at src/crossencoder.rs:140:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    crossencoder::proptests::refine_preserves_count
    crossencoder::tests::test_nan_score_handling
    crossencoder::tests::test_refine
    crossencoder::tests::test_refine_single_candidate

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
