*** src/crossencoder.rs:88:31: replace - with / in refine

*** mutation diff:
--- src/crossencoder.rs
+++ replace - with / in refine
@@ -80,17 +80,17 @@
             (lo.min(s), hi.max(s))
         });
     let range = (max_ce - min_ce).max(1e-9);
 
     let mut results: Vec<(I, Score)> = candidates
         .iter()
         .zip(ce_scores)
         .map(|((id, _, orig), ce)| {
-            let ce_norm = (ce - min_ce) / range;
+            let ce_norm = (ce / /* ~ changed by cargo-mutants ~ */ min_ce) / range;
             // Use mul_add for better precision
             let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
             (id.clone(), blended)
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
     results

---- crossencoder::proptests::refine_scores_bounded stdout ----

thread 'crossencoder::proptests::refine_scores_bounded' (12560207) panicked at src/crossencoder.rs:196:5:
Test failed: Score 1000000000 out of expected bounds at src/crossencoder.rs:280.
minimal failing input: orig_scores = [
    0.0,
    0.0,
], alpha = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    crossencoder::proptests::refine_scores_bounded

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
