*** src/crossencoder.rs:88:41: replace / with % in refine

*** mutation diff:
--- src/crossencoder.rs
+++ replace / with % in refine
@@ -80,17 +80,17 @@
             (lo.min(s), hi.max(s))
         });
     let range = (max_ce - min_ce).max(1e-9);
 
     let mut results: Vec<(I, Score)> = candidates
         .iter()
         .zip(ce_scores)
         .map(|((id, _, orig), ce)| {
-            let ce_norm = (ce - min_ce) / range;
+            let ce_norm = (ce - min_ce) % /* ~ changed by cargo-mutants ~ */ range;
             // Use mul_add for better precision
             let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
             (id.clone(), blended)
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
     results

---- crossencoder::tests::test_refine stdout ----

thread 'crossencoder::tests::test_refine' (12471941) panicked at src/crossencoder.rs:144:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    crossencoder::tests::test_refine

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
