*** src/crossencoder.rs:90:32: replace - with / in refine

*** mutation diff:
--- src/crossencoder.rs
+++ replace - with / in refine
@@ -82,17 +82,17 @@
     let range = (max_ce - min_ce).max(1e-9);
 
     let mut results: Vec<(I, Score)> = candidates
         .iter()
         .zip(ce_scores)
         .map(|((id, _, orig), ce)| {
             let ce_norm = (ce - min_ce) / range;
             // Use mul_add for better precision
-            let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
+            let blended = (1.0 / /* ~ changed by cargo-mutants ~ */ alpha).mul_add(ce_norm, alpha * orig);
             (id.clone(), blended)
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
     results
 }

---- crossencoder::tests::test_refine stdout ----

thread 'crossencoder::tests::test_refine' (12432212) panicked at src/crossencoder.rs:144:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    crossencoder::tests::test_refine

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
