*** src/crossencoder.rs:90:64: replace * with + in refine

*** mutation diff:
--- src/crossencoder.rs
+++ replace * with + in refine
@@ -82,17 +82,17 @@
     let range = (max_ce - min_ce).max(1e-9);
 
     let mut results: Vec<(I, Score)> = candidates
         .iter()
         .zip(ce_scores)
         .map(|((id, _, orig), ce)| {
             let ce_norm = (ce - min_ce) / range;
             // Use mul_add for better precision
-            let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
+            let blended = (1.0 - alpha).mul_add(ce_norm, alpha + /* ~ changed by cargo-mutants ~ */ orig);
             (id.clone(), blended)
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
     results
 }

---- crossencoder::proptests::refine_scores_bounded stdout ----

thread 'crossencoder::proptests::refine_scores_bounded' (12492344) panicked at src/crossencoder.rs:196:5:
Test failed: Score 1.2820042 out of expected bounds at src/crossencoder.rs:280.
minimal failing input: orig_scores = [
    0.0,
    0.37691805,
], alpha = 0.9050862
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    crossencoder::proptests::refine_scores_bounded

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
