*** src/crossencoder.rs:90:64: replace * with / in refine

*** mutation diff:
--- src/crossencoder.rs
+++ replace * with / in refine
@@ -82,17 +82,17 @@
     let range = (max_ce - min_ce).max(1e-9);
 
     let mut results: Vec<(I, Score)> = candidates
         .iter()
         .zip(ce_scores)
         .map(|((id, _, orig), ce)| {
             let ce_norm = (ce - min_ce) / range;
             // Use mul_add for better precision
-            let blended = (1.0 - alpha).mul_add(ce_norm, alpha * orig);
+            let blended = (1.0 - alpha).mul_add(ce_norm, alpha / /* ~ changed by cargo-mutants ~ */ orig);
             (id.clone(), blended)
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
     results
 }

---- crossencoder::proptests::alpha_one_preserves_original_order stdout ----

thread 'crossencoder::proptests::alpha_one_preserves_original_order' (12584765) panicked at src/crossencoder.rs:196:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `2` at src/crossencoder.rs:260.
minimal failing input: scores = [
    0.0,
    0.0,
    0.49812847,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- crossencoder::tests::test_refine stdout ----

thread 'crossencoder::tests::test_refine' (12584771) panicked at src/crossencoder.rs:148:9:
assertion `left == right` failed
  left: "d2"
 right: "d1"

---- crossencoder::proptests::refine_scores_bounded stdout ----

thread 'crossencoder::proptests::refine_scores_bounded' (12584767) panicked at src/crossencoder.rs:196:5:
Test failed: Score NaN out of expected bounds at src/crossencoder.rs:280.
minimal failing input: orig_scores = [
    0.0,
    0.0,
], alpha = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    crossencoder::proptests::alpha_one_preserves_original_order
    crossencoder::proptests::refine_scores_bounded
    crossencoder::tests::test_refine

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
