*** src/lib.rs:122:5: replace as_slices -> Vec<&[f32]> with vec![Vec::leak(vec![0.0])]

*** mutation diff:
--- src/lib.rs
+++ replace as_slices -> Vec<&[f32]> with vec![Vec::leak(vec![0.0])]
@@ -114,17 +114,17 @@
 ///
 /// let tokens = vec![vec![1.0, 0.0], vec![0.0, 1.0]];
 /// let refs = as_slices(&tokens);
 /// let score = simd::maxsim(&refs, &refs);
 /// ```
 #[inline]
 #[must_use]
 pub fn as_slices(tokens: &[Vec<f32>]) -> Vec<&[f32]> {
-    tokens.iter().map(Vec::as_slice).collect()
+    vec![Vec::leak(vec![0.0])] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Sorting Utilities
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Sort scored results in descending order (highest score first).
 ///

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12575158) panicked at src/scoring.rs:336:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12575159) panicked at src/scoring.rs:323:9:
assertion failed: score > 1.5

---- simd::tests::test_maxsim_cosine_vecs stdout ----

thread 'simd::tests::test_maxsim_cosine_vecs' (12575221) panicked at src/simd.rs:347:9:
assertion failed: (maxsim_cosine_vecs(&query, &doc) - 1.0).abs() < 1e-5

failures:
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs
    simd::tests::test_maxsim_cosine_vecs
    simd::tests::test_maxsim_vecs

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
