*** src/lib.rs:122:5: replace as_slices -> Vec<&[f32]> with vec![Vec::leak(vec![-1.0])]

*** mutation diff:
--- src/lib.rs
+++ replace as_slices -> Vec<&[f32]> with vec![Vec::leak(vec![-1.0])]
@@ -114,17 +114,17 @@
 ///
 /// let tokens = vec![vec![1.0, 0.0], vec![0.0, 1.0]];
 /// let refs = as_slices(&tokens);
 /// let score = simd::maxsim(&refs, &refs);
 /// ```
 #[inline]
 #[must_use]
 pub fn as_slices(tokens: &[Vec<f32>]) -> Vec<&[f32]> {
-    tokens.iter().map(Vec::as_slice).collect()
+    vec![Vec::leak(vec![-1.0])] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Sorting Utilities
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Sort scored results in descending order (highest score first).
 ///

---- colbert::tests::test_rank_empty_docs stdout ----

thread 'colbert::tests::test_rank_empty_docs' (12581660) panicked at src/colbert.rs:509:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- colbert::tests::test_rank_empty_query stdout ----

thread 'colbert::tests::test_rank_empty_query' (12581661) panicked at src/colbert.rs:499:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12581731) panicked at src/scoring.rs:323:9:
assertion failed: score > 1.5

failures:
    colbert::tests::test_rank_empty_docs
    colbert::tests::test_rank_empty_query
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs
    simd::tests::test_maxsim_vecs

test result: FAILED. 119 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
