*** src/lib.rs:134:5: replace sort_scored_desc with ()

*** mutation diff:
--- src/lib.rs
+++ replace sort_scored_desc with ()
@@ -126,17 +126,17 @@
 // Sorting Utilities
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Sort scored results in descending order (highest score first).
 ///
 /// Uses `f32::total_cmp` for deterministic ordering of NaN values.
 #[inline]
 pub(crate) fn sort_scored_desc<T>(results: &mut [(T, f32)]) {
-    results.sort_by(|a, b| b.1.total_cmp(&a.1));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Configuration for score blending and truncation.
 ///
 /// ```rust
 /// use rank_refine::RefineConfig;
 ///
 /// let config = RefineConfig::default()

---- colbert::proptests::rank_sorted_descending stdout ----

thread 'colbert::proptests::rank_sorted_descending' (12469507) panicked at src/colbert.rs:710:5:
Test failed: assertion failed: window[0].1 >= window[1].1 at src/colbert.rs:741.
minimal failing input: n_docs = 2, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_refine stdout ----

thread 'colbert::tests::test_refine' (12469533) panicked at src/colbert.rs:522:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- crossencoder::proptests::alpha_one_preserves_original_order stdout ----

thread 'crossencoder::proptests::alpha_one_preserves_original_order' (12469537) panicked at src/crossencoder.rs:196:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `2` at src/crossencoder.rs:260.
minimal failing input: scores = [
    0.0,
    0.0,
    0.9050862,
]
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::rank_sorted_descending
    colbert::tests::test_refine
    crossencoder::proptests::alpha_one_preserves_original_order
    crossencoder::proptests::rerank_sorted_descending
    crossencoder::tests::test_refine
    crossencoder::tests::test_rerank
    matryoshka::proptests::results_sorted_descending
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::proptests::scorer_rank_is_sorted
    scoring::tests::test_dense_rank
    scoring::tests::test_token_scorer_rank_vecs

test result: FAILED. 112 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
