*** src/matryoshka.rs:117:18: replace >= with < in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace >= with < in try_refine
@@ -109,17 +109,17 @@
 /// Returns [`RefineError::InvalidHeadDims`] if `head_dims >= query.len()`.
 pub fn try_refine<I: Clone + Eq + Hash>(
     candidates: &[(I, f32)],
     query: &[f32],
     docs: &[(I, Vec<f32>)],
     head_dims: usize,
     config: RefineConfig,
 ) -> Result<Vec<(I, f32)>> {
-    if head_dims >= query.len() {
+    if head_dims < /* ~ changed by cargo-mutants ~ */ query.len() {
         return Err(RefineError::InvalidHeadDims {
             head_dims,
             query_len: query.len(),
         });
     }
 
     let doc_map: HashMap<&I, &[f32]> = docs
         .iter()

---- matryoshka::proptests::alpha_one_preserves_order stdout ----

thread 'matryoshka::proptests::alpha_one_preserves_order' (12542305) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 5 }

thread 'matryoshka::proptests::alpha_one_preserves_order' (12542305) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 4 }
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-9xl7HX.tmp/proptest-regressions/matryoshka.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc 128a33c2eb6a808e0d6db73dcb17bbeac2f3b034c1d53eacdf03f1388473e77a

thread 'matryoshka::proptests::alpha_one_preserves_order' (12542305) panicked

---- matryoshka::proptests::alpha_interpolation stdout ----

thread 'matryoshka::proptests::alpha_interpolation' (12542304) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 6, query_len: 13 }

thread 'matryoshka::proptests::alpha_interpolation' (12542304) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 5, query_len: 10 }

thread 'matryoshka::proptests::alpha_interpolation' (12542304) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 4, query_len: 9 }

thread 'matryoshka::proptests::alpha_interpolation' (12542304) panicked at src/matryoshka.rs:80:6:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 4, query_len: 8 }
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-ra

---- matryoshka::proptests::results_sorted_descending stdout ----

thread 'matryoshka::proptests::results_sorted_descending' (12542308) panicked at src/matryoshka.rs:53:10:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 4 }

thread 'matryoshka::proptests::results_sorted_descending' (12542308) panicked at src/matryoshka.rs:53:10:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 4 }

thread 'matryoshka::proptests::results_sorted_descending' (12542308) panicked at src/matryoshka.rs:53:10:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 4 }

thread 'matryoshka::proptests::results_sorted_descending' (12542308) panicked at src/matryoshka.rs:53:10:
head_dims must be < query.len(): InvalidHeadDims { head_dims: 2, query_len: 4 }

failures:
    matryoshka::proptests::alpha_interpolation
    matryoshka::proptests::alpha_one_preserves_order
    matryoshka::proptests::config_top_k_limits_output
    matryoshka::proptests::output_bounded_by_candidates
    matryoshka::proptests::results_sorted_descending
    matryoshka::proptests::short_docs_filtered
    matryoshka::proptests::smaller_head_uses_more_dims
    matryoshka::proptests::try_refine_validates_head_dims
    matryoshka::tests::test_head_dims_too_large
    matryoshka::tests::test_missing_candidate
    matryoshka::tests::test_nan_score_handling
    matryoshka::tests::test_refinement

test result: FAILED. 108 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
