*** src/matryoshka.rs:117:5: replace try_refine -> Result<Vec<(I, f32)>> with Ok(vec![])

*** mutation diff:
--- src/matryoshka.rs
+++ replace try_refine -> Result<Vec<(I, f32)>> with Ok(vec![])
@@ -109,49 +109,17 @@
 /// Returns [`RefineError::InvalidHeadDims`] if `head_dims >= query.len()`.
 pub fn try_refine<I: Clone + Eq + Hash>(
     candidates: &[(I, f32)],
     query: &[f32],
     docs: &[(I, Vec<f32>)],
     head_dims: usize,
     config: RefineConfig,
 ) -> Result<Vec<(I, f32)>> {
-    if head_dims >= query.len() {
-        return Err(RefineError::InvalidHeadDims {
-            head_dims,
-            query_len: query.len(),
-        });
-    }
-
-    let doc_map: HashMap<&I, &[f32]> = docs
-        .iter()
-        .filter(|(_, emb)| emb.len() > head_dims)
-        .map(|(id, emb)| (id, emb.as_slice()))
-        .collect();
-    let query_tail = &query[head_dims..];
-    let alpha = config.alpha;
-
-    let mut results: Vec<(I, f32)> = candidates
-        .iter()
-        .filter_map(|(id, orig)| {
-            let doc_emb = doc_map.get(id)?;
-            let doc_tail = &doc_emb[head_dims..];
-            let tail_sim = simd::cosine(query_tail, doc_tail);
-            let blended = (1.0 - alpha).mul_add(tail_sim, alpha * orig);
-            Some((id.clone(), blended))
-        })
-        .collect();
-
-    crate::sort_scored_desc(&mut results);
-
-    if let Some(k) = config.top_k {
-        results.truncate(k);
-    }
-
-    Ok(results)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]
 mod tests {

---- matryoshka::tests::test_head_dims_too_large stdout ----
note: test did not panic as expected at src/matryoshka.rs:190:8

---- matryoshka::tests::test_missing_candidate stdout ----

thread 'matryoshka::tests::test_missing_candidate' (12469757) panicked at src/matryoshka.rs:174:9:
assertion `left == right` failed
  left: 0
 right: 1

---- matryoshka::tests::test_nan_score_handling stdout ----

thread 'matryoshka::tests::test_nan_score_handling' (12469758) panicked at src/matryoshka.rs:209:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    matryoshka::proptests::alpha_one_preserves_order
    matryoshka::proptests::short_docs_filtered
    matryoshka::proptests::smaller_head_uses_more_dims
    matryoshka::proptests::try_refine_validates_head_dims
    matryoshka::tests::test_head_dims_too_large
    matryoshka::tests::test_missing_candidate
    matryoshka::tests::test_nan_score_handling
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    matryoshka::tests::test_short_doc_embedding
    matryoshka::tests::test_top_k
    matryoshka::tests::test_try_refine_error

test result: FAILED. 112 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
