*** src/matryoshka.rs:126:38: replace > with >= in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace > with >= in try_refine
@@ -118,17 +118,17 @@
         return Err(RefineError::InvalidHeadDims {
             head_dims,
             query_len: query.len(),
         });
     }
 
     let doc_map: HashMap<&I, &[f32]> = docs
         .iter()
-        .filter(|(_, emb)| emb.len() > head_dims)
+        .filter(|(_, emb)| emb.len() >= /* ~ changed by cargo-mutants ~ */ head_dims)
         .map(|(id, emb)| (id, emb.as_slice()))
         .collect();
     let query_tail = &query[head_dims..];
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig)| {

*** result: Success
