*** src/matryoshka.rs:126:38: replace > with == in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace > with == in try_refine
@@ -118,17 +118,17 @@
         return Err(RefineError::InvalidHeadDims {
             head_dims,
             query_len: query.len(),
         });
     }
 
     let doc_map: HashMap<&I, &[f32]> = docs
         .iter()
-        .filter(|(_, emb)| emb.len() > head_dims)
+        .filter(|(_, emb)| emb.len() == /* ~ changed by cargo-mutants ~ */ head_dims)
         .map(|(id, emb)| (id, emb.as_slice()))
         .collect();
     let query_tail = &query[head_dims..];
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig)| {

---- matryoshka::proptests::alpha_one_preserves_order stdout ----

thread 'matryoshka::proptests::alpha_one_preserves_order' (12572285) panicked at src/matryoshka.rs:272:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `3` at src/matryoshka.rs:304.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::proptests::short_docs_filtered stdout ----

thread 'matryoshka::proptests::short_docs_filtered' (12572289) panicked at src/matryoshka.rs:272:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/matryoshka.rs:404.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::proptests::smaller_head_uses_more_dims stdout ----

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12572290) panicked at src/matryoshka.rs:384:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12572290) panicked at src/matryoshka.rs:384:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12572290) panicked at src/matryoshka.rs:384:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12572290) panicked at src/matryoshka.rs:384:38:
index out of bounds: the len is 0 but the index is 0

failures:
    matryoshka::proptests::alpha_one_preserves_order
    matryoshka::proptests::short_docs_filtered
    matryoshka::proptests::smaller_head_uses_more_dims
    matryoshka::tests::test_missing_candidate
    matryoshka::tests::test_nan_score_handling
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    matryoshka::tests::test_short_doc_embedding
    matryoshka::tests::test_top_k

test result: FAILED. 115 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
