*** src/matryoshka.rs:138:32: replace - with / in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace - with / in try_refine
@@ -130,17 +130,17 @@
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig)| {
             let doc_emb = doc_map.get(id)?;
             let doc_tail = &doc_emb[head_dims..];
             let tail_sim = simd::cosine(query_tail, doc_tail);
-            let blended = (1.0 - alpha).mul_add(tail_sim, alpha * orig);
+            let blended = (1.0 / /* ~ changed by cargo-mutants ~ */ alpha).mul_add(tail_sim, alpha * orig);
             Some((id.clone(), blended))
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
 
     if let Some(k) = config.top_k {
         results.truncate(k);

---- matryoshka::proptests::alpha_interpolation stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-DHUa65.tmp/proptest-regressions/matryoshka.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc ee831cb1945522bfb5466ac016caccec755fea7d4ffa26539e267edadae103e0

thread 'matryoshka::proptests::alpha_interpolation' (12448512) panicked at src/matryoshka.rs:272:5:
Test failed: alpha=0.5 score 1.1284667 not between 1.1642334 and inf at src/matryoshka.rs:359.
minimal failing input: dim = 10
	successes: 1
	local rejects: 0
	global rejects: 0

---- matryoshka::proptests::smaller_head_uses_more_dims stdout ----

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12448520) panicked at src/matryoshka.rs:272:5:
Test failed: assertion failed: r_small_head[0].1.is_finite() at src/matryoshka.rs:384.
minimal failing input: dim = 16
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12448526) panicked at src/matryoshka.rs:186:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    matryoshka::proptests::alpha_interpolation
    matryoshka::proptests::smaller_head_uses_more_dims
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
