*** src/matryoshka.rs:138:32: replace - with + in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace - with + in try_refine
@@ -130,17 +130,17 @@
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig)| {
             let doc_emb = doc_map.get(id)?;
             let doc_tail = &doc_emb[head_dims..];
             let tail_sim = simd::cosine(query_tail, doc_tail);
-            let blended = (1.0 - alpha).mul_add(tail_sim, alpha * orig);
+            let blended = (1.0 + /* ~ changed by cargo-mutants ~ */ alpha).mul_add(tail_sim, alpha * orig);
             Some((id.clone(), blended))
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
 
     if let Some(k) = config.top_k {
         results.truncate(k);

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12510800) panicked at src/matryoshka.rs:183:9:
assertion `left == right` failed
  left: "d2"
 right: "d1"

failures:
    matryoshka::tests::test_refinement_with_alpha

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
