*** src/matryoshka.rs:138:65: replace * with / in try_refine

*** mutation diff:
--- src/matryoshka.rs
+++ replace * with / in try_refine
@@ -130,17 +130,17 @@
     let alpha = config.alpha;
 
     let mut results: Vec<(I, f32)> = candidates
         .iter()
         .filter_map(|(id, orig)| {
             let doc_emb = doc_map.get(id)?;
             let doc_tail = &doc_emb[head_dims..];
             let tail_sim = simd::cosine(query_tail, doc_tail);
-            let blended = (1.0 - alpha).mul_add(tail_sim, alpha * orig);
+            let blended = (1.0 - alpha).mul_add(tail_sim, alpha / /* ~ changed by cargo-mutants ~ */ orig);
             Some((id.clone(), blended))
         })
         .collect();
 
     crate::sort_scored_desc(&mut results);
 
     if let Some(k) = config.top_k {
         results.truncate(k);

---- matryoshka::proptests::alpha_one_preserves_order stdout ----

thread 'matryoshka::proptests::alpha_one_preserves_order' (12464350) panicked at src/matryoshka.rs:272:5:
Test failed: assertion failed: `(left == right)` 
  left: `3`,
 right: `1` at src/matryoshka.rs:305.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12464363) panicked at src/matryoshka.rs:183:9:
assertion `left == right` failed
  left: "d2"
 right: "d1"

failures:
    matryoshka::proptests::alpha_one_preserves_order
    matryoshka::tests::test_refinement_with_alpha

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
