*** src/matryoshka.rs:52:5: replace refine -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/matryoshka.rs
+++ replace refine -> Vec<(I, f32)> with vec![]
@@ -44,18 +44,17 @@
 /// - Document embeddings shorter than `head_dims` are skipped.
 #[must_use]
 pub fn refine<I: Clone + Eq + Hash>(
     candidates: &[(I, f32)],
     query: &[f32],
     docs: &[(I, Vec<f32>)],
     head_dims: usize,
 ) -> Vec<(I, f32)> {
-    try_refine(candidates, query, docs, head_dims, RefineConfig::default())
-        .expect("head_dims must be < query.len()")
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Refine with custom blending weight.
 ///
 /// # Arguments
 ///
 /// * `alpha` - Weight for original score (0.0 = all tail, 1.0 = all original)
 ///

---- matryoshka::proptests::short_docs_filtered stdout ----

thread 'matryoshka::proptests::short_docs_filtered' (12578623) panicked at src/matryoshka.rs:271:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/matryoshka.rs:403.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::tests::test_head_dims_too_large stdout ----
note: test did not panic as expected at src/matryoshka.rs:221:8

---- matryoshka::tests::test_missing_candidate stdout ----

thread 'matryoshka::tests::test_missing_candidate' (12578628) panicked at src/matryoshka.rs:205:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    matryoshka::proptests::short_docs_filtered
    matryoshka::tests::test_head_dims_too_large
    matryoshka::tests::test_missing_candidate
    matryoshka::tests::test_nan_score_handling
    matryoshka::tests::test_short_doc_embedding

test result: FAILED. 119 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
