*** src/matryoshka.rs:73:5: replace refine_with_alpha -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/matryoshka.rs
+++ replace refine_with_alpha -> Vec<(I, f32)> with vec![]
@@ -65,24 +65,17 @@
 #[must_use]
 pub fn refine_with_alpha<I: Clone + Eq + Hash>(
     candidates: &[(I, f32)],
     query: &[f32],
     docs: &[(I, Vec<f32>)],
     head_dims: usize,
     alpha: f32,
 ) -> Vec<(I, f32)> {
-    try_refine(
-        candidates,
-        query,
-        docs,
-        head_dims,
-        RefineConfig::default().with_alpha(alpha),
-    )
-    .expect("head_dims must be < query.len()")
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Refine using only tail dimensions (ignore original scores).
 ///
 /// # Panics
 ///
 /// Panics if `head_dims >= query.len()`.
 #[must_use]

---- matryoshka::proptests::alpha_one_preserves_order stdout ----

thread 'matryoshka::proptests::alpha_one_preserves_order' (12480146) panicked at src/matryoshka.rs:265:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `3` at src/matryoshka.rs:297.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12480157) panicked at src/matryoshka.rs:176:27:
index out of bounds: the len is 0 but the index is 0

failures:
    matryoshka::proptests::alpha_one_preserves_order
    matryoshka::tests::test_refinement_with_alpha

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
