*** src/matryoshka.rs:95:5: replace refine_tail_only -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/matryoshka.rs
+++ replace refine_tail_only -> Vec<(I, f32)> with vec![]
@@ -87,24 +87,17 @@
 /// Panics if `head_dims >= query.len()`.
 #[must_use]
 pub fn refine_tail_only<I: Clone + Eq + Hash>(
     candidates: &[(I, f32)],
     query: &[f32],
     docs: &[(I, Vec<f32>)],
     head_dims: usize,
 ) -> Vec<(I, f32)> {
-    try_refine(
-        candidates,
-        query,
-        docs,
-        head_dims,
-        RefineConfig::refinement_only(),
-    )
-    .expect("head_dims must be < query.len()")
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Fallible refinement with full configuration.
 ///
 /// # Errors
 ///
 /// Returns [`RefineError::InvalidHeadDims`] if `head_dims >= query.len()`.
 pub fn try_refine<I: Clone + Eq + Hash>(

---- matryoshka::proptests::smaller_head_uses_more_dims stdout ----

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12442024) panicked at src/matryoshka.rs:377:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12442024) panicked at src/matryoshka.rs:377:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12442024) panicked at src/matryoshka.rs:377:38:
index out of bounds: the len is 0 but the index is 0

thread 'matryoshka::proptests::smaller_head_uses_more_dims' (12442024) panicked at src/matryoshka.rs:377:38:
index out of bounds: the len is 0 but the index is 0

---- matryoshka::tests::test_refinement stdout ----

thread 'matryoshka::tests::test_refinement' (12442033) panicked at src/matryoshka.rs:163:27:
index out of bounds: the len is 0 but the index is 0

failures:
    matryoshka::proptests::smaller_head_uses_more_dims
    matryoshka::tests::test_refinement

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
