*** src/scoring.rs:106:9: replace TokenScorer::rank_tokens -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace TokenScorer::rank_tokens -> Vec<(I, f32)> with vec![]
@@ -98,22 +98,17 @@
     fn score_vecs(&self, query: &[Vec<f32>], doc: &[Vec<f32>]) -> f32 {
         let q = crate::as_slices(query);
         let d = crate::as_slices(doc);
         self.score_tokens(&q, &d)
     }
 
     /// Rank documents by token-level score (descending).
     fn rank_tokens<I: Clone>(&self, query: &[&[f32]], docs: &[(I, Vec<&[f32]>)]) -> Vec<(I, f32)> {
-        let mut results: Vec<(I, f32)> = docs
-            .iter()
-            .map(|(id, doc_tokens)| (id.clone(), self.score_tokens(query, doc_tokens)))
-            .collect();
-        crate::sort_scored_desc(&mut results);
-        results
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rank with owned document vectors (convenience wrapper).
     fn rank_vecs<I: Clone>(
         &self,
         query: &[Vec<f32>],
         docs: &[(I, Vec<Vec<f32>>)],
     ) -> Vec<(I, f32)> {

---- scoring::proptests::token_scorer_rank_preserves_count stdout ----

thread 'scoring::proptests::token_scorer_rank_preserves_count' (12428310) panicked at src/scoring.rs:344:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/scoring.rs:606.
minimal failing input: n_docs = 1, n_q = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::token_scorer_rank_preserves_count

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
