*** src/scoring.rs:120:9: replace TokenScorer::rank_vecs -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace TokenScorer::rank_vecs -> Vec<(I, f32)> with vec![]
@@ -112,26 +112,17 @@
     }
 
     /// Rank with owned document vectors (convenience wrapper).
     fn rank_vecs<I: Clone>(
         &self,
         query: &[Vec<f32>],
         docs: &[(I, Vec<Vec<f32>>)],
     ) -> Vec<(I, f32)> {
-        let q = crate::as_slices(query);
-        let mut results: Vec<(I, f32)> = docs
-            .iter()
-            .map(|(id, doc_tokens)| {
-                let d = crate::as_slices(doc_tokens);
-                (id.clone(), self.score_tokens(&q, &d))
-            })
-            .collect();
-        crate::sort_scored_desc(&mut results);
-        results
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl TokenScorer for LateInteractionScorer {
     fn score_tokens(&self, query: &[&[f32]], doc: &[&[f32]]) -> f32 {
         self.score(query, doc)
     }
 }

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12444498) panicked at src/scoring.rs:327:26:
index out of bounds: the len is 0 but the index is 0

failures:
    scoring::tests::test_token_scorer_rank_vecs

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
