*** src/scoring.rs:135:9: replace <impl TokenScorer for LateInteractionScorer>::score_tokens -> f32 with 0.0

*** mutation diff:
--- src/scoring.rs
+++ replace <impl TokenScorer for LateInteractionScorer>::score_tokens -> f32 with 0.0
@@ -127,17 +127,17 @@
             .collect();
         crate::sort_scored_desc(&mut results);
         results
     }
 }
 
 impl TokenScorer for LateInteractionScorer {
     fn score_tokens(&self, query: &[&[f32]], doc: &[&[f32]]) -> f32 {
-        self.score(query, doc)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Score Blending
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Blend two scores with a weight parameter.

---- scoring::tests::test_late_interaction_maxsim stdout ----

thread 'scoring::tests::test_late_interaction_maxsim' (12445650) panicked at src/scoring.rs:283:9:
assertion failed: (scorer.score_tokens(&query, &doc) - 1.0).abs() < 1e-5

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12445654) panicked at src/scoring.rs:336:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12445655) panicked at src/scoring.rs:323:9:
assertion failed: score > 1.5

failures:
    scoring::tests::test_late_interaction_maxsim
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
