*** src/scoring.rs:151:42: replace * with / in blend

*** mutation diff:
--- src/scoring.rs
+++ replace * with / in blend
@@ -143,17 +143,17 @@
 /// Blend two scores with a weight parameter.
 ///
 /// `blended = alpha * score_a + (1 - alpha) * score_b`
 ///
 /// Uses `mul_add` for better floating-point precision.
 #[inline]
 #[must_use]
 pub fn blend(score_a: f32, score_b: f32, alpha: f32) -> f32 {
-    (1.0 - alpha).mul_add(score_b, alpha * score_a)
+    (1.0 - alpha).mul_add(score_b, alpha / /* ~ changed by cargo-mutants ~ */ score_a)
 }
 
 /// Normalize scores to \[0, 1\] range.
 ///
 /// Returns original scores if all values are equal (avoids division by zero).
 #[must_use]
 pub fn normalize_scores(scores: &[f32]) -> Vec<f32> {
     if scores.is_empty() {

---- scoring::proptests::blend_alpha_one stdout ----

thread 'scoring::proptests::blend_alpha_one' (12509548) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: (blended - a).abs() < 1e-5 at src/scoring.rs:388.
minimal failing input: a = 0.0, b = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::blend_is_linear stdout ----

thread 'scoring::proptests::blend_is_linear' (12509550) panicked at src/scoring.rs:349:5:
Test failed: blend(0, 0, 0) = NaN, expected 0 at src/scoring.rs:425.
minimal failing input: a = 0.0, b = 0.0, alpha = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::blend_alpha_one
    scoring::proptests::blend_is_linear

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
