*** src/scoring.rs:151:5: replace blend -> f32 with -1.0

*** mutation diff:
--- src/scoring.rs
+++ replace blend -> f32 with -1.0
@@ -143,17 +143,17 @@
 /// Blend two scores with a weight parameter.
 ///
 /// `blended = alpha * score_a + (1 - alpha) * score_b`
 ///
 /// Uses `mul_add` for better floating-point precision.
 #[inline]
 #[must_use]
 pub fn blend(score_a: f32, score_b: f32, alpha: f32) -> f32 {
-    (1.0 - alpha).mul_add(score_b, alpha * score_a)
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Normalize scores to \[0, 1\] range.
 ///
 /// Returns original scores if all values are equal (avoids division by zero).
 #[must_use]
 pub fn normalize_scores(scores: &[f32]) -> Vec<f32> {
     if scores.is_empty() {

---- scoring::proptests::blend_alpha_one stdout ----

thread 'scoring::proptests::blend_alpha_one' (12556446) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: (blended - a).abs() < 1e-5 at src/scoring.rs:388.
minimal failing input: a = 0.0, b = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::blend_is_linear stdout ----

thread 'scoring::proptests::blend_is_linear' (12556448) panicked at src/scoring.rs:349:5:
Test failed: blend(0, 0, 0) = -1, expected 0 at src/scoring.rs:425.
minimal failing input: a = 0.0, b = 0.0, alpha = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::blend_alpha_zero stdout ----

thread 'scoring::proptests::blend_alpha_zero' (12556447) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: (blended - b).abs() < 1e-5 at src/scoring.rs:395.
minimal failing input: a = 0.0, b = 0.0
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::blend_alpha_one
    scoring::proptests::blend_alpha_zero
    scoring::proptests::blend_is_linear
    scoring::tests::test_blend

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
