*** src/scoring.rs:159:5: replace normalize_scores -> Vec<f32> with vec![0.0]

*** mutation diff:
--- src/scoring.rs
+++ replace normalize_scores -> Vec<f32> with vec![0.0]
@@ -151,33 +151,17 @@
     (1.0 - alpha).mul_add(score_b, alpha * score_a)
 }
 
 /// Normalize scores to \[0, 1\] range.
 ///
 /// Returns original scores if all values are equal (avoids division by zero).
 #[must_use]
 pub fn normalize_scores(scores: &[f32]) -> Vec<f32> {
-    if scores.is_empty() {
-        return Vec::new();
-    }
-
-    let (min, max) = scores
-        .iter()
-        .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
-            (lo.min(s), hi.max(s))
-        });
-
-    let range = max - min;
-    if range < 1e-9 {
-        // All scores equal, return 0.5 for all
-        return vec![0.5; scores.len()];
-    }
-
-    scores.iter().map(|&s| (s - min) / range).collect()
+    vec![0.0] /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Pooler Trait
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Token embedding compression.
 ///

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12501267) panicked at src/scoring.rs:398:71:
index out of bounds: the len is 1 but the index is 1

thread 'scoring::proptests::normalize_preserves_order' (12501267) panicked at src/scoring.rs:398:71:
index out of bounds: the len is 1 but the index is 1

thread 'scoring::proptests::normalize_preserves_order' (12501267) panicked at src/scoring.rs:398:71:
index out of bounds: the len is 1 but the index is 1

thread 'scoring::proptests::normalize_preserves_order' (12501267) panicked at src/scoring.rs:398:71:
index out of bounds: the len is 1 but the index is 1

---- scoring::tests::test_normalize_scores stdout ----

thread 'scoring::tests::test_normalize_scores' (12501289) panicked at src/scoring.rs:282:28:
index out of bounds: the len is 1 but the index is 1

---- scoring::tests::test_normalize_scores_empty stdout ----

thread 'scoring::tests::test_normalize_scores_empty' (12501290) panicked at src/scoring.rs:297:9:
assertion failed: normalized.is_empty()

failures:
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores
    scoring::tests::test_normalize_scores_empty
    scoring::tests::test_normalize_scores_equal

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
