*** src/scoring.rs:169:21: replace - with / in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace - with / in normalize_scores
@@ -161,17 +161,17 @@
     }
 
     let (min, max) = scores
         .iter()
         .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
             (lo.min(s), hi.max(s))
         });
 
-    let range = max - min;
+    let range = max / /* ~ changed by cargo-mutants ~ */ min;
     if range < 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
     scores.iter().map(|&s| (s - min) / range).collect()
 }

---- scoring::proptests::normalize_bounded stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-DHUa65.tmp/proptest-regressions/scoring.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc c451703401f22394dec495b61739424036397178b4515edc134b6e7ac577cf13

thread 'scoring::proptests::normalize_bounded' (12521755) panicked at src/scoring.rs:349:5:
Test failed: Score 317.69208 out of bounds at src/scoring.rs:403.
minimal failing input: scores = [
    -58.574158,
    -9.118362,
]
	successes: 38
	local rejects: 0
	global rejects: 0

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12521756) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: `(left == right)` 
  left: `Greater`, 
 right: `Equal`: Order changed at indices (0, 1) at src/scoring.rs:415.
minimal failing input: scores = [
    0.0,
    -87.67196,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_normalize_scores stdout ----

thread 'scoring::tests::test_normalize_scores' (12521774) panicked at src/scoring.rs:298:9:
assertion failed: (normalized[1] - 0.5).abs() < 1e-5

failures:
    scoring::proptests::normalize_bounded
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores
    scoring::tests::test_normalize_scores_equal

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
