*** src/scoring.rs:169:21: replace - with + in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace - with + in normalize_scores
@@ -161,17 +161,17 @@
     }
 
     let (min, max) = scores
         .iter()
         .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
             (lo.min(s), hi.max(s))
         });
 
-    let range = max - min;
+    let range = max + /* ~ changed by cargo-mutants ~ */ min;
     if range < 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
     scores.iter().map(|&s| (s - min) / range).collect()
 }

---- scoring::proptests::normalize_bounded stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-2ZFznG.tmp/proptest-regressions/scoring.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 6722b56f357538d6a593c14e2f41242c6605f530a237e9acfe82297e01acc05f

thread 'scoring::proptests::normalize_bounded' (12555157) panicked at src/scoring.rs:349:5:
Test failed: Score 1.8909194 out of bounds at src/scoring.rs:403.
minimal failing input: scores = [
    91.87677,
    -28.314455,
]
	successes: 1
	local rejects: 0
	global rejects: 0

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12555158) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: `(left == right)` 
  left: `Less`, 
 right: `Equal`: Order changed at indices (0, 1) at src/scoring.rs:415.
minimal failing input: scores = [
    -94.726555,
    0.0,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_normalize_scores_equal stdout ----

thread 'scoring::tests::test_normalize_scores_equal' (12555177) panicked at src/scoring.rs:306:9:
assertion failed: normalized.iter().all(|&s| (s - 0.5).abs() < 1e-5)

failures:
    scoring::proptests::normalize_bounded
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores_equal

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
