*** src/scoring.rs:170:14: replace < with > in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace < with > in normalize_scores
@@ -162,17 +162,17 @@
 
     let (min, max) = scores
         .iter()
         .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
             (lo.min(s), hi.max(s))
         });
 
     let range = max - min;
-    if range < 1e-9 {
+    if range > /* ~ changed by cargo-mutants ~ */ 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
     scores.iter().map(|&s| (s - min) / range).collect()
 }
 
 // ─────────────────────────────────────────────────────────────────────────────

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12507560) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: `(left == right)` 
  left: `Less`, 
 right: `Equal`: Order changed at indices (0, 1) at src/scoring.rs:415.
minimal failing input: scores = [
    0.0,
    22.663675,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_normalize_scores stdout ----

thread 'scoring::tests::test_normalize_scores' (12507577) panicked at src/scoring.rs:297:9:
assertion failed: (normalized[0] - 0.0).abs() < 1e-5

---- scoring::tests::test_normalize_scores_equal stdout ----

thread 'scoring::tests::test_normalize_scores_equal' (12507579) panicked at src/scoring.rs:306:9:
assertion failed: normalized.iter().all(|&s| (s - 0.5).abs() < 1e-5)

failures:
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores
    scoring::tests::test_normalize_scores_equal

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
