*** src/scoring.rs:170:14: replace < with == in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace < with == in normalize_scores
@@ -162,17 +162,17 @@
 
     let (min, max) = scores
         .iter()
         .fold((f32::INFINITY, f32::NEG_INFINITY), |(lo, hi), &s| {
             (lo.min(s), hi.max(s))
         });
 
     let range = max - min;
-    if range < 1e-9 {
+    if range == /* ~ changed by cargo-mutants ~ */ 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
     scores.iter().map(|&s| (s - min) / range).collect()
 }
 
 // ─────────────────────────────────────────────────────────────────────────────

---- scoring::tests::test_normalize_scores_equal stdout ----

thread 'scoring::tests::test_normalize_scores_equal' (12511283) panicked at src/scoring.rs:306:9:
assertion failed: normalized.iter().all(|&s| (s - 0.5).abs() < 1e-5)

failures:
    scoring::tests::test_normalize_scores_equal

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
