*** src/scoring.rs:175:31: replace - with / in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace - with / in normalize_scores
@@ -167,17 +167,17 @@
         });
 
     let range = max - min;
     if range < 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
-    scores.iter().map(|&s| (s - min) / range).collect()
+    scores.iter().map(|&s| (s / /* ~ changed by cargo-mutants ~ */ min) / range).collect()
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Pooler Trait
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Token embedding compression.
 ///

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12522528) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: `(left == right)` 
  left: `Less`, 
 right: `Greater`: Order changed at indices (0, 1) at src/scoring.rs:415.
minimal failing input: scores = [
    0.0,
    15.857103,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::normalize_bounded stdout ----
proptest: Saving this and future failures in /private/var/folders/dt/jq9nqy8x2wd65h22qb9rptjr0000gn/T/cargo-mutants-rank-refine-9xl7HX.tmp/proptest-regressions/scoring.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc b29b968320924edf409c0eb66440a1f23f1fd0448e4fe7ddf3276f68d4a6f81e

thread 'scoring::proptests::normalize_bounded' (12522522) panicked at src/scoring.rs:349:5:
Test failed: Score NaN out of bounds at src/scoring.rs:403.
minimal failing input: scores = [
    0.0,
    8.016316,
]
	successes: 9
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_normalize_scores stdout ----

thread 'scoring::tests::test_normalize_scores' (12522577) panicked at src/scoring.rs:297:9:
assertion failed: (normalized[0] - 0.0).abs() < 1e-5

failures:
    scoring::proptests::normalize_bounded
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
