*** src/scoring.rs:175:38: replace / with % in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace / with % in normalize_scores
@@ -167,17 +167,17 @@
         });
 
     let range = max - min;
     if range < 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
-    scores.iter().map(|&s| (s - min) / range).collect()
+    scores.iter().map(|&s| (s - min) % /* ~ changed by cargo-mutants ~ */ range).collect()
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Pooler Trait
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Token embedding compression.
 ///

---- scoring::proptests::normalize_bounded stdout ----

thread 'scoring::proptests::normalize_bounded' (12479835) panicked at src/scoring.rs:349:5:
Test failed: Score 88.57345 out of bounds at src/scoring.rs:403.
minimal failing input: scores = [
    0.0,
    66.31572,
    -88.57345,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::normalize_preserves_order stdout ----

thread 'scoring::proptests::normalize_preserves_order' (12479836) panicked at src/scoring.rs:349:5:
Test failed: assertion failed: `(left == right)` 
  left: `Less`, 
 right: `Equal`: Order changed at indices (0, 1) at src/scoring.rs:415.
minimal failing input: scores = [
    0.0,
    66.31572,
]
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_normalize_scores stdout ----

thread 'scoring::tests::test_normalize_scores' (12479853) panicked at src/scoring.rs:299:9:
assertion failed: (normalized[2] - 1.0).abs() < 1e-5

failures:
    scoring::proptests::normalize_bounded
    scoring::proptests::normalize_preserves_order
    scoring::tests::test_normalize_scores

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.80s

*** result: Failure(101)
