*** src/scoring.rs:175:38: replace / with * in normalize_scores

*** mutation diff:
--- src/scoring.rs
+++ replace / with * in normalize_scores
@@ -167,17 +167,17 @@
         });
 
     let range = max - min;
     if range < 1e-9 {
         // All scores equal, return 0.5 for all
         return vec![0.5; scores.len()];
     }
 
-    scores.iter().map(|&s| (s - min) / range).collect()
+    scores.iter().map(|&s| (s - min) * /* ~ changed by cargo-mutants ~ */ range).collect()
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Pooler Trait
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Token embedding compression.
 ///

---- scoring::proptests::normalize_bounded stdout ----

thread 'scoring::proptests::normalize_bounded' (12570538) panicked at src/scoring.rs:349:5:
Test failed: Score 64.26133 out of bounds at src/scoring.rs:403.
minimal failing input: scores = [
    0.0,
    8.016316,
]
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::normalize_bounded

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
