*** src/scoring.rs:191:9: replace Pooler::pool_by_factor -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace Pooler::pool_by_factor -> Vec<Vec<f32>> with vec![]
@@ -183,20 +183,17 @@
 ///
 /// Invariants: output.len() <= input.len(), dimension preserved, empty in → empty out.
 pub trait Pooler {
     /// Pool to approximately `target_count` vectors.
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>>;
 
     /// Pool with compression factor (2 = 50% reduction, 3 = 66%, etc).
     fn pool_by_factor(&self, tokens: &[Vec<f32>], factor: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || factor <= 1 {
-            return tokens.to_vec();
-        }
-        self.pool(tokens, (tokens.len() / factor).max(1))
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Sequential window pooling (fastest, position-aware).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct SequentialPooler;
 
 impl Pooler for SequentialPooler {

---- scoring::proptests::pooler_factor_one_identity stdout ----

thread 'scoring::proptests::pooler_factor_one_identity' (12548242) panicked at src/scoring.rs:346:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/scoring.rs:547.
minimal failing input: n_tokens = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::pooler_factor_one_identity

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
