*** src/scoring.rs:204:9: replace <impl Pooler for SequentialPooler>::pool -> Vec<Vec<f32>> with vec![vec![1.0]]

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Pooler for SequentialPooler>::pool -> Vec<Vec<f32>> with vec![vec![1.0]]
@@ -196,21 +196,17 @@
 }
 
 /// Sequential window pooling (fastest, position-aware).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct SequentialPooler;
 
 impl Pooler for SequentialPooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
-            return tokens.to_vec();
-        }
-        let window = tokens.len().div_ceil(target_count);
-        crate::colbert::pool_tokens_sequential(tokens, window)
+        vec![vec![1.0]] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Greedy clustering pooler (default, quality-focused).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct ClusteringPooler;
 
 impl Pooler for ClusteringPooler {

---- scoring::proptests::pooler_empty_input stdout ----

thread 'scoring::proptests::pooler_empty_input' (12581248) panicked at src/scoring.rs:345:5:
Test failed: assertion failed: SequentialPooler.pool(&empty, target).is_empty() at src/scoring.rs:530.
minimal failing input: target = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::pooler_preserves_dimension stdout ----

thread 'scoring::proptests::pooler_preserves_dimension' (12581251) panicked at src/scoring.rs:345:5:
Test failed: Sequential changed dim at src/scoring.rs:520.
minimal failing input: n_tokens = 2, dim = 2, factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::pooler_empty_input
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
