*** src/scoring.rs:204:9: replace <impl Pooler for SequentialPooler>::pool -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Pooler for SequentialPooler>::pool -> Vec<Vec<f32>> with vec![]
@@ -196,21 +196,17 @@
 }
 
 /// Sequential window pooling (fastest, position-aware).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct SequentialPooler;
 
 impl Pooler for SequentialPooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
-            return tokens.to_vec();
-        }
-        let window = tokens.len().div_ceil(target_count);
-        crate::colbert::pool_tokens_sequential(tokens, window)
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Greedy clustering pooler (default, quality-focused).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct ClusteringPooler;
 
 impl Pooler for ClusteringPooler {

---- e2e_token_pooling_storage_workflow stdout ----

thread 'e2e_token_pooling_storage_workflow' (12585729) panicked at tests/integration.rs:194:9:
sequential shouldn't over-reduce

failures:
    e2e_token_pooling_storage_workflow

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
