*** src/scoring.rs:218:30: replace || with && in <impl Pooler for ClusteringPooler>::pool

*** mutation diff:
--- src/scoring.rs
+++ replace || with && in <impl Pooler for ClusteringPooler>::pool
@@ -210,17 +210,17 @@
 }
 
 /// Greedy clustering pooler (default, quality-focused).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct ClusteringPooler;
 
 impl Pooler for ClusteringPooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
+        if tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ target_count >= tokens.len() {
             return tokens.to_vec();
         }
         let factor = tokens.len().div_ceil(target_count);
         crate::colbert::pool_tokens(tokens, factor)
     }
 }
 
 /// Adaptive pooler that chooses the best strategy based on compression factor.

*** result: Success
