*** src/scoring.rs:218:9: replace <impl Pooler for ClusteringPooler>::pool -> Vec<Vec<f32>> with vec![vec![0.0]]

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Pooler for ClusteringPooler>::pool -> Vec<Vec<f32>> with vec![vec![0.0]]
@@ -210,21 +210,17 @@
 }
 
 /// Greedy clustering pooler (default, quality-focused).
 #[derive(Debug, Clone, Copy, Default)]
 pub struct ClusteringPooler;
 
 impl Pooler for ClusteringPooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
-            return tokens.to_vec();
-        }
-        let factor = tokens.len().div_ceil(target_count);
-        crate::colbert::pool_tokens(tokens, factor)
+        vec![vec![0.0]] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Adaptive pooler that chooses the best strategy based on compression factor.
 #[derive(Debug, Clone, Copy, Default)]
 pub struct AdaptivePooler;
 
 impl Pooler for AdaptivePooler {

---- scoring::proptests::pooler_empty_input stdout ----

thread 'scoring::proptests::pooler_empty_input' (12556274) panicked at src/scoring.rs:345:5:
Test failed: assertion failed: ClusteringPooler.pool(&empty, target).is_empty() at src/scoring.rs:531.
minimal failing input: target = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::pooler_preserves_dimension stdout ----

thread 'scoring::proptests::pooler_preserves_dimension' (12556277) panicked at src/scoring.rs:345:5:
Test failed: Clustering changed dim at src/scoring.rs:521.
minimal failing input: n_tokens = 2, dim = 2, factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::pooler_empty_input
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
