*** src/scoring.rs:232:46: replace >= with < in <impl Pooler for AdaptivePooler>::pool

*** mutation diff:
--- src/scoring.rs
+++ replace >= with < in <impl Pooler for AdaptivePooler>::pool
@@ -224,17 +224,17 @@
 }
 
 /// Adaptive pooler that chooses the best strategy based on compression factor.
 #[derive(Debug, Clone, Copy, Default)]
 pub struct AdaptivePooler;
 
 impl Pooler for AdaptivePooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
+        if tokens.is_empty() || target_count < /* ~ changed by cargo-mutants ~ */ tokens.len() {
             return tokens.to_vec();
         }
         let factor = tokens.len().div_ceil(target_count);
         crate::colbert::pool_tokens_adaptive(tokens, factor)
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────

*** result: Success
