*** src/scoring.rs:232:9: replace <impl Pooler for AdaptivePooler>::pool -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Pooler for AdaptivePooler>::pool -> Vec<Vec<f32>> with vec![]
@@ -224,21 +224,17 @@
 }
 
 /// Adaptive pooler that chooses the best strategy based on compression factor.
 #[derive(Debug, Clone, Copy, Default)]
 pub struct AdaptivePooler;
 
 impl Pooler for AdaptivePooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
-            return tokens.to_vec();
-        }
-        let factor = tokens.len().div_ceil(target_count);
-        crate::colbert::pool_tokens_adaptive(tokens, factor)
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]

---- e2e_token_pooling_storage_workflow stdout ----

thread 'e2e_token_pooling_storage_workflow' (12435143) panicked at tests/integration.rs:194:9:
adaptive shouldn't over-reduce

failures:
    e2e_token_pooling_storage_workflow

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
