*** src/scoring.rs:232:9: replace <impl Pooler for AdaptivePooler>::pool -> Vec<Vec<f32>> with vec![vec![-1.0]]

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Pooler for AdaptivePooler>::pool -> Vec<Vec<f32>> with vec![vec![-1.0]]
@@ -224,21 +224,17 @@
 }
 
 /// Adaptive pooler that chooses the best strategy based on compression factor.
 #[derive(Debug, Clone, Copy, Default)]
 pub struct AdaptivePooler;
 
 impl Pooler for AdaptivePooler {
     fn pool(&self, tokens: &[Vec<f32>], target_count: usize) -> Vec<Vec<f32>> {
-        if tokens.is_empty() || target_count >= tokens.len() {
-            return tokens.to_vec();
-        }
-        let factor = tokens.len().div_ceil(target_count);
-        crate::colbert::pool_tokens_adaptive(tokens, factor)
+        vec![vec![-1.0]] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Tests
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(test)]

---- scoring::proptests::pooler_empty_input stdout ----

thread 'scoring::proptests::pooler_empty_input' (12572042) panicked at src/scoring.rs:345:5:
Test failed: assertion failed: AdaptivePooler.pool(&empty, target).is_empty() at src/scoring.rs:532.
minimal failing input: target = 1
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::pooler_preserves_dimension stdout ----

thread 'scoring::proptests::pooler_preserves_dimension' (12572045) panicked at src/scoring.rs:345:5:
Test failed: Adaptive changed dim at src/scoring.rs:522.
minimal failing input: n_tokens = 2, dim = 2, factor = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    scoring::proptests::pooler_empty_input
    scoring::proptests::pooler_preserves_dimension

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
