*** src/scoring.rs:33:9: replace DenseScorer::score -> f32 with -1.0

*** mutation diff:
--- src/scoring.rs
+++ replace DenseScorer::score -> f32 with -1.0
@@ -25,20 +25,17 @@
     /// Cosine similarity (normalizes vectors).
     Cosine,
 }
 
 impl DenseScorer {
     /// Score similarity between query and document embeddings.
     #[must_use]
     pub fn score(&self, query: &[f32], doc: &[f32]) -> f32 {
-        match self {
-            Self::Dot => simd::dot(query, doc),
-            Self::Cosine => simd::cosine(query, doc),
-        }
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Trait for dense (single-vector) scoring.
 ///
 /// Implement this for custom similarity functions.
 pub trait Scorer {
     /// Score similarity between query and document.

---- scoring::tests::test_dense_cosine stdout ----

thread 'scoring::tests::test_dense_cosine' (12584344) panicked at src/scoring.rs:255:9:
assertion failed: (scorer.score(&[2.0, 0.0], &[1.0, 0.0]) - 1.0).abs() < 1e-5

---- scoring::tests::test_dense_dot stdout ----

thread 'scoring::tests::test_dense_dot' (12584345) panicked at src/scoring.rs:248:9:
assertion failed: (scorer.score(&[1.0, 0.0], &[1.0, 0.0]) - 1.0).abs() < 1e-5

---- scoring::tests::test_dense_rank stdout ----

thread 'scoring::tests::test_dense_rank' (12584346) panicked at src/scoring.rs:266:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_dot
    scoring::tests::test_dense_rank

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.21s

*** result: Failure(101)
