*** src/scoring.rs:49:9: replace Scorer::rank -> Vec<(I, f32)> with vec![]

*** mutation diff:
--- src/scoring.rs
+++ replace Scorer::rank -> Vec<(I, f32)> with vec![]
@@ -41,22 +41,17 @@
 ///
 /// Implement this for custom similarity functions.
 pub trait Scorer {
     /// Score similarity between query and document.
     fn score(&self, query: &[f32], doc: &[f32]) -> f32;
 
     /// Rank documents by score (descending).
     fn rank<I: Clone>(&self, query: &[f32], docs: &[(I, &[f32])]) -> Vec<(I, f32)> {
-        let mut results: Vec<(I, f32)> = docs
-            .iter()
-            .map(|(id, doc)| (id.clone(), self.score(query, doc)))
-            .collect();
-        crate::sort_scored_desc(&mut results);
-        results
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Scorer for DenseScorer {
     fn score(&self, query: &[f32], doc: &[f32]) -> f32 {
         DenseScorer::score(self, query, doc)
     }
 }

---- scoring::proptests::scorer_rank_preserves_count stdout ----

thread 'scoring::proptests::scorer_rank_preserves_count' (12482306) panicked at src/scoring.rs:344:5:
Test failed: assertion failed: `(left == right)` 
  left: `0`,
 right: `1` at src/scoring.rs:376.
minimal failing input: n = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_dense_rank stdout ----

thread 'scoring::tests::test_dense_rank' (12482312) panicked at src/scoring.rs:264:26:
index out of bounds: the len is 0 but the index is 0

failures:
    scoring::proptests::scorer_rank_preserves_count
    scoring::tests::test_dense_rank

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
