*** src/scoring.rs:60:9: replace <impl Scorer for DenseScorer>::score -> f32 with 0.0

*** mutation diff:
--- src/scoring.rs
+++ replace <impl Scorer for DenseScorer>::score -> f32 with 0.0
@@ -52,17 +52,17 @@
             .collect();
         crate::sort_scored_desc(&mut results);
         results
     }
 }
 
 impl Scorer for DenseScorer {
     fn score(&self, query: &[f32], doc: &[f32]) -> f32 {
-        DenseScorer::score(self, query, doc)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Late Interaction Scoring (multi-vector)
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Scoring strategy for late interaction (multi-vector) embeddings.

---- scoring::tests::test_dense_rank stdout ----

thread 'scoring::tests::test_dense_rank' (12518245) panicked at src/scoring.rs:269:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    scoring::tests::test_dense_rank

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
