*** src/scoring.rs:83:9: replace LateInteractionScorer::score -> f32 with 1.0

*** mutation diff:
--- src/scoring.rs
+++ replace LateInteractionScorer::score -> f32 with 1.0
@@ -75,20 +75,17 @@
 }
 
 impl LateInteractionScorer {
     /// Score similarity between query and document token embeddings.
     ///
     /// Returns the sum over query tokens of max similarity to any doc token.
     #[must_use]
     pub fn score(&self, query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-        match self {
-            Self::MaxSimDot => simd::maxsim(query_tokens, doc_tokens),
-            Self::MaxSimCosine => simd::maxsim_cosine(query_tokens, doc_tokens),
-        }
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Multi-vector scoring (late interaction).
 ///
 /// Provides both slice-based (`&[&[f32]]`) and owned (`&[Vec<f32>]`) methods.
 pub trait TokenScorer {
     /// Score similarity between query tokens and document tokens.

---- scoring::proptests::late_interaction_empty_doc stdout ----

thread 'scoring::proptests::late_interaction_empty_doc' (12446595) panicked at src/scoring.rs:346:5:
Test failed: Empty doc should return 0, got 1 at src/scoring.rs:475.
minimal failing input: dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12446624) panicked at src/scoring.rs:333:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12446625) panicked at src/scoring.rs:320:9:
assertion failed: score > 1.5

failures:
    scoring::proptests::late_interaction_empty_doc
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
