*** src/scoring.rs:83:9: replace LateInteractionScorer::score -> f32 with -1.0

*** mutation diff:
--- src/scoring.rs
+++ replace LateInteractionScorer::score -> f32 with -1.0
@@ -75,20 +75,17 @@
 }
 
 impl LateInteractionScorer {
     /// Score similarity between query and document token embeddings.
     ///
     /// Returns the sum over query tokens of max similarity to any doc token.
     #[must_use]
     pub fn score(&self, query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-        match self {
-            Self::MaxSimDot => simd::maxsim(query_tokens, doc_tokens),
-            Self::MaxSimCosine => simd::maxsim_cosine(query_tokens, doc_tokens),
-        }
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Multi-vector scoring (late interaction).
 ///
 /// Provides both slice-based (`&[&[f32]]`) and owned (`&[Vec<f32>]`) methods.
 pub trait TokenScorer {
     /// Score similarity between query tokens and document tokens.

---- scoring::proptests::late_interaction_empty_doc stdout ----

thread 'scoring::proptests::late_interaction_empty_doc' (12460742) panicked at src/scoring.rs:346:5:
Test failed: Empty doc should return 0, got -1 at src/scoring.rs:475.
minimal failing input: dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::proptests::late_interaction_nonnegative stdout ----

thread 'scoring::proptests::late_interaction_nonnegative' (12460743) panicked at src/scoring.rs:346:5:
Test failed: `MaxSim` score -1 should be non-negative at src/scoring.rs:463.
minimal failing input: q_tokens = 1, d_tokens = 1, dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_late_interaction_maxsim stdout ----

thread 'scoring::tests::test_late_interaction_maxsim' (12460768) panicked at src/scoring.rs:280:9:
assertion failed: (scorer.score_tokens(&query, &doc) - 1.0).abs() < 1e-5

failures:
    scoring::proptests::late_interaction_empty_doc
    scoring::proptests::late_interaction_nonnegative
    scoring::tests::test_late_interaction_maxsim
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs

test result: FAILED. 119 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
