*** src/scoring.rs:83:9: replace LateInteractionScorer::score -> f32 with 0.0

*** mutation diff:
--- src/scoring.rs
+++ replace LateInteractionScorer::score -> f32 with 0.0
@@ -75,20 +75,17 @@
 }
 
 impl LateInteractionScorer {
     /// Score similarity between query and document token embeddings.
     ///
     /// Returns the sum over query tokens of max similarity to any doc token.
     #[must_use]
     pub fn score(&self, query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-        match self {
-            Self::MaxSimDot => simd::maxsim(query_tokens, doc_tokens),
-            Self::MaxSimCosine => simd::maxsim_cosine(query_tokens, doc_tokens),
-        }
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Multi-vector scoring (late interaction).
 ///
 /// Provides both slice-based (`&[&[f32]]`) and owned (`&[Vec<f32>]`) methods.
 pub trait TokenScorer {
     /// Score similarity between query tokens and document tokens.

---- scoring::tests::test_late_interaction_maxsim stdout ----

thread 'scoring::tests::test_late_interaction_maxsim' (12498147) panicked at src/scoring.rs:280:9:
assertion failed: (scorer.score_tokens(&query, &doc) - 1.0).abs() < 1e-5

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12498152) panicked at src/scoring.rs:333:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12498153) panicked at src/scoring.rs:320:9:
assertion failed: score > 1.5

failures:
    scoring::tests::test_late_interaction_maxsim
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs

test result: FAILED. 121 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
