*** src/scoring.rs:99:9: replace TokenScorer::score_vecs -> f32 with 0.0

*** mutation diff:
--- src/scoring.rs
+++ replace TokenScorer::score_vecs -> f32 with 0.0
@@ -91,19 +91,17 @@
 ///
 /// Provides both slice-based (`&[&[f32]]`) and owned (`&[Vec<f32>]`) methods.
 pub trait TokenScorer {
     /// Score similarity between query tokens and document tokens.
     fn score_tokens(&self, query: &[&[f32]], doc: &[&[f32]]) -> f32;
 
     /// Score with owned vectors (convenience wrapper).
     fn score_vecs(&self, query: &[Vec<f32>], doc: &[Vec<f32>]) -> f32 {
-        let q = crate::as_slices(query);
-        let d = crate::as_slices(doc);
-        self.score_tokens(&q, &d)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rank documents by token-level score (descending).
     fn rank_tokens<I: Clone>(&self, query: &[&[f32]], docs: &[(I, Vec<&[f32]>)]) -> Vec<(I, f32)> {
         let mut results: Vec<(I, f32)> = docs
             .iter()
             .map(|(id, doc_tokens)| (id.clone(), self.score_tokens(query, doc_tokens)))
             .collect();

---- scoring::tests::test_token_scorer_score_vecs stdout ----

thread 'scoring::tests::test_token_scorer_score_vecs' (12532290) panicked at src/scoring.rs:321:9:
assertion failed: score > 1.5

failures:
    scoring::tests::test_token_scorer_score_vecs

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
