*** src/simd.rs:122:5: replace maxsim_vecs -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim_vecs -> f32 with 1.0
@@ -114,19 +114,17 @@
 ///
 /// let query = vec![vec![1.0, 0.0], vec![0.0, 1.0]];
 /// let doc = vec![vec![0.9, 0.1], vec![0.1, 0.9]];
 /// let score = maxsim_vecs(&query, &doc);
 /// ```
 #[inline]
 #[must_use]
 pub fn maxsim_vecs(query_tokens: &[Vec<f32>], doc_tokens: &[Vec<f32>]) -> f32 {
-    let q = crate::as_slices(query_tokens);
-    let d = crate::as_slices(doc_tokens);
-    maxsim(&q, &d)
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim` cosine for owned token vectors (convenience wrapper).
 #[inline]
 #[must_use]
 pub fn maxsim_cosine_vecs(query_tokens: &[Vec<f32>], doc_tokens: &[Vec<f32>]) -> f32 {
     let q = crate::as_slices(query_tokens);
     let d = crate::as_slices(doc_tokens);

---- simd::tests::test_maxsim_vecs stdout ----

thread 'simd::tests::test_maxsim_vecs' (12549973) panicked at src/simd.rs:337:9:
assertion failed: (maxsim_vecs(&query, &doc) - 2.0).abs() < 1e-5

failures:
    simd::tests::test_maxsim_vecs

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
