*** src/simd.rs:131:5: replace maxsim_cosine_vecs -> f32 with -1.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim_cosine_vecs -> f32 with -1.0
@@ -123,19 +123,17 @@
     let d = crate::as_slices(doc_tokens);
     maxsim(&q, &d)
 }
 
 /// `MaxSim` cosine for owned token vectors (convenience wrapper).
 #[inline]
 #[must_use]
 pub fn maxsim_cosine_vecs(query_tokens: &[Vec<f32>], doc_tokens: &[Vec<f32>]) -> f32 {
-    let q = crate::as_slices(query_tokens);
-    let d = crate::as_slices(doc_tokens);
-    maxsim_cosine(&q, &d)
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Portable fallback
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Portable dot product implementation (reference for SIMD versions).
 #[inline]

---- simd::tests::test_maxsim_cosine_vecs stdout ----

thread 'simd::tests::test_maxsim_cosine_vecs' (12550360) panicked at src/simd.rs:345:9:
assertion failed: (maxsim_cosine_vecs(&query, &doc) - 1.0).abs() < 1e-5

failures:
    simd::tests::test_maxsim_cosine_vecs

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
