*** src/simd.rs:144:5: replace dot_portable -> f32 with 0.0

*** mutation diff:
--- src/simd.rs
+++ replace dot_portable -> f32 with 0.0
@@ -136,17 +136,17 @@
 // ─────────────────────────────────────────────────────────────────────────────
 // Portable fallback
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// Portable dot product implementation (reference for SIMD versions).
 #[inline]
 #[must_use]
 pub(crate) fn dot_portable(a: &[f32], b: &[f32]) -> f32 {
-    a.iter().zip(b.iter()).map(|(x, y)| x * y).sum()
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // AVX2 + FMA (x86_64)
 // ─────────────────────────────────────────────────────────────────────────────
 
 #[cfg(target_arch = "x86_64")]
 #[target_feature(enable = "avx2", enable = "fma")]

---- simd::proptests::dot_simd_matches_portable stdout ----

thread 'simd::proptests::dot_simd_matches_portable' (12544568) panicked at src/simd.rs:384:5:
Test failed: SIMD 6.6301875 != portable 0 at src/simd.rs:390.
minimal failing input: a = [
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,
    0.0,

---- simd::tests::test_dot_simd_vs_portable stdout ----

thread 'simd::tests::test_dot_simd_vs_portable' (12544580) panicked at src/simd.rs:282:13:
Mismatch at len=3: portable=0, simd=0.4, diff=0.4

failures:
    simd::proptests::dot_simd_matches_portable
    simd::tests::test_dot_simd_vs_portable

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.18s

*** result: Failure(101)
