*** src/simd.rs:20:5: replace dot -> f32 with -1.0

*** mutation diff:
--- src/simd.rs
+++ replace dot -> f32 with -1.0
@@ -12,32 +12,17 @@
 
 /// Dot product of two vectors.
 ///
 /// If vectors have different lengths, uses the shorter length.
 /// Returns 0.0 for empty vectors.
 #[inline]
 #[must_use]
 pub fn dot(a: &[f32], b: &[f32]) -> f32 {
-    #[cfg(target_arch = "x86_64")]
-    {
-        if is_x86_feature_detected!("avx2") && is_x86_feature_detected!("fma") {
-            // SAFETY: We've verified AVX2 and FMA are available via runtime detection.
-            // The function handles mismatched lengths by using min(a.len(), b.len()).
-            return unsafe { dot_avx2(a, b) };
-        }
-    }
-    #[cfg(target_arch = "aarch64")]
-    {
-        // SAFETY: NEON is always available on aarch64.
-        // The function handles mismatched lengths by using min(a.len(), b.len()).
-        return unsafe { dot_neon(a, b) };
-    }
-    #[allow(unreachable_code)]
-    dot_portable(a, b)
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// L2 norm of a vector.
 #[inline]
 #[must_use]
 pub fn norm(v: &[f32]) -> f32 {
     dot(v, v).sqrt()
 }

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12487750) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = 0 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12487734) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12487748) panicked at src/colbert.rs:710:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:914.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_maintains_score_quality
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pooling_idempotent_at_target
    colbert::tests::test_maxsim_with_pooled_tokens
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::proptests::late_interaction_nonnegative
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_dot
    scoring::tests::test_dense_rank
    scoring::tests::test_late_interaction_maxsim

test result: FAILED. 93 passed; 31 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.82s

*** result: Failure(101)
