*** src/simd.rs:20:5: replace dot -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace dot -> f32 with 1.0
@@ -12,32 +12,17 @@
 
 /// Dot product of two vectors.
 ///
 /// If vectors have different lengths, uses the shorter length.
 /// Returns 0.0 for empty vectors.
 #[inline]
 #[must_use]
 pub fn dot(a: &[f32], b: &[f32]) -> f32 {
-    #[cfg(target_arch = "x86_64")]
-    {
-        if is_x86_feature_detected!("avx2") && is_x86_feature_detected!("fma") {
-            // SAFETY: We've verified AVX2 and FMA are available via runtime detection.
-            // The function handles mismatched lengths by using min(a.len(), b.len()).
-            return unsafe { dot_avx2(a, b) };
-        }
-    }
-    #[cfg(target_arch = "aarch64")]
-    {
-        // SAFETY: NEON is always available on aarch64.
-        // The function handles mismatched lengths by using min(a.len(), b.len()).
-        return unsafe { dot_neon(a, b) };
-    }
-    #[allow(unreachable_code)]
-    dot_portable(a, b)
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// L2 norm of a vector.
 #[inline]
 #[must_use]
 pub fn norm(v: &[f32]) -> f32 {
     dot(v, v).sqrt()
 }

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12559625) panicked at src/matryoshka.rs:186:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- matryoshka::tests::test_refinement stdout ----

thread 'matryoshka::tests::test_refinement' (12559624) panicked at src/matryoshka.rs:170:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_dense_cosine stdout ----

thread 'scoring::tests::test_dense_cosine' (12559669) panicked at src/scoring.rs:259:9:
assertion failed: (scorer.score(&[1.0, 0.0], &[0.0, 1.0])).abs() < 1e-5

failures:
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_dot
    scoring::tests::test_dense_rank
    scoring::tests::test_token_scorer_rank_vecs
    simd::proptests::dot_bilinear
    simd::proptests::dot_simd_matches_portable
    simd::proptests::norm_scaling
    simd::tests::test_cosine_basic
    simd::tests::test_cosine_zero_norm
    simd::tests::test_dot_basic

test result: FAILED. 109 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
