*** src/simd.rs:22:45: replace && with || in dot

*** mutation diff:
--- src/simd.rs
+++ replace && with || in dot
@@ -14,17 +14,17 @@
 ///
 /// If vectors have different lengths, uses the shorter length.
 /// Returns 0.0 for empty vectors.
 #[inline]
 #[must_use]
 pub fn dot(a: &[f32], b: &[f32]) -> f32 {
     #[cfg(target_arch = "x86_64")]
     {
-        if is_x86_feature_detected!("avx2") && is_x86_feature_detected!("fma") {
+        if is_x86_feature_detected!("avx2") || /* ~ changed by cargo-mutants ~ */ is_x86_feature_detected!("fma") {
             // SAFETY: We've verified AVX2 and FMA are available via runtime detection.
             // The function handles mismatched lengths by using min(a.len(), b.len()).
             return unsafe { dot_avx2(a, b) };
         }
     }
     #[cfg(target_arch = "aarch64")]
     {
         // SAFETY: NEON is always available on aarch64.

*** result: Success
