*** src/simd.rs:42:5: replace norm -> f32 with -1.0

*** mutation diff:
--- src/simd.rs
+++ replace norm -> f32 with -1.0
@@ -34,17 +34,17 @@
     #[allow(unreachable_code)]
     dot_portable(a, b)
 }
 
 /// L2 norm of a vector.
 #[inline]
 #[must_use]
 pub fn norm(v: &[f32]) -> f32 {
-    dot(v, v).sqrt()
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Cosine similarity between two vectors.
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12447122) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12447133) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = 0 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pool_preserves_vector_mass stdout ----

thread 'colbert::proptests::pool_preserves_vector_mass' (12447130) panicked at src/colbert.rs:710:5:
Test failed: Pooled vectors should have positive norm at src/colbert.rs:914.
minimal failing input: n_tokens = 4, dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pool_preserves_vector_mass
    colbert::proptests::pooling_idempotent_at_target
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_rank
    simd::proptests::cauchy_schwarz
    simd::proptests::cosine_self_is_one
    simd::proptests::dot_self_is_squared_norm
    simd::proptests::norm_nonnegative
    simd::proptests::norm_scaling

test result: FAILED. 109 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 4.33s

*** result: Failure(101)
