*** src/simd.rs:42:5: replace norm -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace norm -> f32 with 1.0
@@ -34,17 +34,17 @@
     #[allow(unreachable_code)]
     dot_portable(a, b)
 }
 
 /// L2 norm of a vector.
 #[inline]
 #[must_use]
 pub fn norm(v: &[f32]) -> f32 {
-    dot(v, v).sqrt()
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Cosine similarity between two vectors.
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12473643) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0.31156078 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12473653) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = 0.13676842 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_dense_cosine stdout ----

thread 'scoring::tests::test_dense_cosine' (12473766) panicked at src/scoring.rs:258:9:
assertion failed: (scorer.score(&[2.0, 0.0], &[1.0, 0.0]) - 1.0).abs() < 1e-5

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pooling_idempotent_at_target
    scoring::tests::test_dense_cosine
    simd::proptests::cauchy_schwarz
    simd::proptests::cosine_bounded
    simd::proptests::cosine_self_is_one
    simd::proptests::dot_self_is_squared_norm
    simd::proptests::norm_scaling
    simd::tests::test_maxsim_cosine_vecs

test result: FAILED. 115 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
