*** src/simd.rs:51:5: replace cosine -> f32 with -1.0

*** mutation diff:
--- src/simd.rs
+++ replace cosine -> f32 with -1.0
@@ -43,24 +43,17 @@
 }
 
 /// Cosine similarity between two vectors.
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {
-    let d = dot(a, b);
-    let na = norm(a);
-    let nb = norm(b);
-    if na > 1e-9 && nb > 1e-9 {
-        d / (na * nb)
-    } else {
-        0.0
-    }
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim`: sum over query tokens of max dot product with any doc token.
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12510910) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = -1 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12510920) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = -1 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- matryoshka::tests::test_refinement stdout ----

thread 'matryoshka::tests::test_refinement' (12510977) panicked at src/matryoshka.rs:170:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pooling_idempotent_at_target
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_rank
    simd::proptests::cosine_self_is_one
    simd::tests::test_cosine_basic
    simd::tests::test_cosine_zero_norm
    simd::tests::test_maxsim_cosine_basic
    simd::tests::test_maxsim_cosine_vecs

test result: FAILED. 113 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
