*** src/simd.rs:51:5: replace cosine -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace cosine -> f32 with 1.0
@@ -43,24 +43,17 @@
 }
 
 /// Cosine similarity between two vectors.
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {
-    let d = dot(a, b);
-    let na = norm(a);
-    let nb = norm(b);
-    if na > 1e-9 && nb > 1e-9 {
-        d / (na * nb)
-    } else {
-        0.0
-    }
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim`: sum over query tokens of max dot product with any doc token.
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).

---- matryoshka::tests::test_refinement_with_alpha stdout ----

thread 'matryoshka::tests::test_refinement_with_alpha' (12570005) panicked at src/matryoshka.rs:186:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- matryoshka::tests::test_refinement stdout ----

thread 'matryoshka::tests::test_refinement' (12570004) panicked at src/matryoshka.rs:170:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

---- scoring::tests::test_dense_cosine stdout ----

thread 'scoring::tests::test_dense_cosine' (12570048) panicked at src/scoring.rs:259:9:
assertion failed: (scorer.score(&[1.0, 0.0], &[0.0, 1.0])).abs() < 1e-5

failures:
    matryoshka::tests::test_refinement
    matryoshka::tests::test_refinement_with_alpha
    scoring::tests::test_dense_cosine
    scoring::tests::test_dense_rank
    simd::tests::test_cosine_basic
    simd::tests::test_cosine_zero_norm

test result: FAILED. 118 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
