*** src/simd.rs:54:11: replace > with >= in cosine

*** mutation diff:
--- src/simd.rs
+++ replace > with >= in cosine
@@ -46,17 +46,17 @@
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {
     let d = dot(a, b);
     let na = norm(a);
     let nb = norm(b);
-    if na > 1e-9 && nb > 1e-9 {
+    if na >= /* ~ changed by cargo-mutants ~ */ 1e-9 && nb > 1e-9 {
         d / (na * nb)
     } else {
         0.0
     }
 }
 
 /// `MaxSim`: sum over query tokens of max dot product with any doc token.
 ///

*** result: Success
