*** src/simd.rs:54:18: replace && with || in cosine

*** mutation diff:
--- src/simd.rs
+++ replace && with || in cosine
@@ -46,17 +46,17 @@
 ///
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {
     let d = dot(a, b);
     let na = norm(a);
     let nb = norm(b);
-    if na > 1e-9 && nb > 1e-9 {
+    if na > 1e-9 || /* ~ changed by cargo-mutants ~ */ nb > 1e-9 {
         d / (na * nb)
     } else {
         0.0
     }
 }
 
 /// `MaxSim`: sum over query tokens of max dot product with any doc token.
 ///

---- simd::tests::test_cosine_zero_norm stdout ----

thread 'simd::tests::test_cosine_zero_norm' (12562217) panicked at src/simd.rs:301:9:
assertion `left == right` failed
  left: NaN
 right: 0.0

failures:
    simd::tests::test_cosine_zero_norm

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
