*** src/simd.rs:55:11: replace / with * in cosine

*** mutation diff:
--- src/simd.rs
+++ replace / with * in cosine
@@ -47,17 +47,17 @@
 /// Returns 0.0 if either vector has zero norm.
 #[inline]
 #[must_use]
 pub fn cosine(a: &[f32], b: &[f32]) -> f32 {
     let d = dot(a, b);
     let na = norm(a);
     let nb = norm(b);
     if na > 1e-9 && nb > 1e-9 {
-        d / (na * nb)
+        d * /* ~ changed by cargo-mutants ~ */ (na * nb)
     } else {
         0.0
     }
 }
 
 /// `MaxSim`: sum over query tokens of max dot product with any doc token.
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.

---- colbert::proptests::duplicate_tokens_cluster stdout ----

thread 'colbert::proptests::duplicate_tokens_cluster' (12495886) panicked at src/colbert.rs:710:5:
Test failed: Duplicate tokens didn't cluster well: max_sim = 0.119886085 at src/colbert.rs:949.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::proptests::pooling_idempotent_at_target stdout ----

thread 'colbert::proptests::pooling_idempotent_at_target' (12495896) panicked at src/colbert.rs:710:5:
Test failed: Pool not idempotent: similarity = 0.018705599 at src/colbert.rs:1028.
minimal failing input: dim = 4
	successes: 0
	local rejects: 0
	global rejects: 0

---- scoring::tests::test_dense_cosine stdout ----

thread 'scoring::tests::test_dense_cosine' (12495995) panicked at src/scoring.rs:258:9:
assertion failed: (scorer.score(&[2.0, 0.0], &[1.0, 0.0]) - 1.0).abs() < 1e-5

failures:
    colbert::proptests::duplicate_tokens_cluster
    colbert::proptests::pooling_idempotent_at_target
    scoring::tests::test_dense_cosine
    simd::proptests::cosine_bounded
    simd::proptests::cosine_self_is_one
    simd::tests::test_maxsim_cosine_vecs

test result: FAILED. 118 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
