*** src/simd.rs:70:32: replace || with && in maxsim

*** mutation diff:
--- src/simd.rs
+++ replace || with && in maxsim
@@ -62,17 +62,17 @@
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).
 #[inline]
 #[must_use]
 pub fn maxsim(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
+    if query_tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ doc_tokens.is_empty() {
         return 0.0;
     }
     query_tokens
         .iter()
         .map(|q| {
             doc_tokens
                 .iter()
                 .map(|d| dot(q, d))

---- colbert::tests::test_rank_empty_docs stdout ----

thread 'colbert::tests::test_rank_empty_docs' (12477779) panicked at src/colbert.rs:509:9:
assertion `left == right` failed
  left: -inf
 right: 0.0

---- scoring::proptests::late_interaction_empty_doc stdout ----

thread 'scoring::proptests::late_interaction_empty_doc' (12477816) panicked at src/scoring.rs:349:5:
Test failed: Empty doc should return 0, got -inf at src/scoring.rs:478.
minimal failing input: dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

---- simd::proptests::maxsim_empty_returns_zero stdout ----

thread 'simd::proptests::maxsim_empty_returns_zero' (12477864) panicked at src/simd.rs:384:5:
Test failed: assertion failed: `(left == right)` 
  left: `-inf`,
 right: `0.0` at src/simd.rs:454.
minimal failing input: q_data = [
    [
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,
        0.0,

failures:
    colbert::tests::test_rank_empty_docs
    scoring::proptests::late_interaction_empty_doc
    simd::proptests::maxsim_empty_returns_zero
    simd::tests::test_maxsim_empty_doc

test result: FAILED. 120 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
