*** src/simd.rs:70:5: replace maxsim -> f32 with -1.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim -> f32 with -1.0
@@ -62,28 +62,17 @@
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).
 #[inline]
 #[must_use]
 pub fn maxsim(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
-        return 0.0;
-    }
-    query_tokens
-        .iter()
-        .map(|q| {
-            doc_tokens
-                .iter()
-                .map(|d| dot(q, d))
-                .fold(f32::NEG_INFINITY, f32::max)
-        })
-        .sum()
+    -1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
     if query_tokens.is_empty() || doc_tokens.is_empty() {
         return 0.0;

---- colbert::proptests::pool_maintains_score_quality stdout ----

thread 'colbert::proptests::pool_maintains_score_quality' (12437474) panicked at src/colbert.rs:710:5:
Test failed: Score dropped too much: -1 -> -1 at src/colbert.rs:861.
minimal failing input: dim = 8
	successes: 0
	local rejects: 0
	global rejects: 0

---- colbert::tests::test_maxsim_with_pooled_tokens stdout ----

thread 'colbert::tests::test_maxsim_with_pooled_tokens' (12437491) panicked at src/colbert.rs:695:9:
assertion failed: score_pooled > 0.0

---- colbert::tests::test_rank_empty_docs stdout ----

thread 'colbert::tests::test_rank_empty_docs' (12437504) panicked at src/colbert.rs:509:9:
assertion `left == right` failed
  left: -1.0
 right: 0.0

failures:
    colbert::proptests::pool_maintains_score_quality
    colbert::tests::test_maxsim_with_pooled_tokens
    colbert::tests::test_rank_empty_docs
    colbert::tests::test_rank_empty_query
    scoring::proptests::late_interaction_empty_doc
    scoring::proptests::late_interaction_nonnegative
    scoring::tests::test_late_interaction_maxsim
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs
    simd::proptests::maxsim_empty_returns_zero
    simd::proptests::maxsim_nonnegative_inputs
    simd::proptests::maxsim_scales_with_query_count

test result: FAILED. 108 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
