*** src/simd.rs:70:5: replace maxsim -> f32 with 0.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim -> f32 with 0.0
@@ -62,28 +62,17 @@
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).
 #[inline]
 #[must_use]
 pub fn maxsim(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
-        return 0.0;
-    }
-    query_tokens
-        .iter()
-        .map(|q| {
-            doc_tokens
-                .iter()
-                .map(|d| dot(q, d))
-                .fold(f32::NEG_INFINITY, f32::max)
-        })
-        .sum()
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
     if query_tokens.is_empty() || doc_tokens.is_empty() {
         return 0.0;

---- colbert::tests::test_maxsim_with_pooled_tokens stdout ----

thread 'colbert::tests::test_maxsim_with_pooled_tokens' (12473200) panicked at src/colbert.rs:695:9:
assertion failed: score_pooled > 0.0

---- scoring::tests::test_late_interaction_maxsim stdout ----

thread 'scoring::tests::test_late_interaction_maxsim' (12473339) panicked at src/scoring.rs:283:9:
assertion failed: (scorer.score_tokens(&query, &doc) - 1.0).abs() < 1e-5

---- scoring::tests::test_token_scorer_rank_vecs stdout ----

thread 'scoring::tests::test_token_scorer_rank_vecs' (12473346) panicked at src/scoring.rs:336:9:
assertion `left == right` failed
  left: "d1"
 right: "d2"

failures:
    colbert::tests::test_maxsim_with_pooled_tokens
    scoring::tests::test_late_interaction_maxsim
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs
    simd::proptests::maxsim_scales_with_query_count
    simd::tests::test_maxsim_basic
    simd::tests::test_maxsim_vecs

test result: FAILED. 117 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
