*** src/simd.rs:70:5: replace maxsim -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim -> f32 with 1.0
@@ -62,28 +62,17 @@
 ///
 /// Used by ColBERT/PLAID for late interaction scoring.
 ///
 /// Returns 0.0 if `query_tokens` is empty.
 /// Returns 0.0 if `doc_tokens` is empty (no matches possible).
 #[inline]
 #[must_use]
 pub fn maxsim(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
-        return 0.0;
-    }
-    query_tokens
-        .iter()
-        .map(|q| {
-            doc_tokens
-                .iter()
-                .map(|d| dot(q, d))
-                .fold(f32::NEG_INFINITY, f32::max)
-        })
-        .sum()
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
     if query_tokens.is_empty() || doc_tokens.is_empty() {
         return 0.0;

---- colbert::tests::test_rank_empty_docs stdout ----

thread 'colbert::tests::test_rank_empty_docs' (12484930) panicked at src/colbert.rs:509:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- colbert::tests::test_rank_empty_query stdout ----

thread 'colbert::tests::test_rank_empty_query' (12484931) panicked at src/colbert.rs:499:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

---- scoring::proptests::late_interaction_empty_doc stdout ----

thread 'scoring::proptests::late_interaction_empty_doc' (12485007) panicked at src/scoring.rs:349:5:
Test failed: Empty doc should return 0, got 1 at src/scoring.rs:478.
minimal failing input: dim = 2
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    colbert::tests::test_rank_empty_docs
    colbert::tests::test_rank_empty_query
    scoring::proptests::late_interaction_empty_doc
    scoring::tests::test_token_scorer_rank_vecs
    scoring::tests::test_token_scorer_score_vecs
    simd::proptests::maxsim_empty_returns_zero
    simd::proptests::maxsim_scales_with_query_count
    simd::tests::test_maxsim_basic
    simd::tests::test_maxsim_empty_doc
    simd::tests::test_maxsim_empty_query
    simd::tests::test_maxsim_vecs

test result: FAILED. 113 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
