*** src/simd.rs:88:32: replace || with && in maxsim_cosine

*** mutation diff:
--- src/simd.rs
+++ replace || with && in maxsim_cosine
@@ -80,17 +80,17 @@
         })
         .sum()
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
+    if query_tokens.is_empty() && /* ~ changed by cargo-mutants ~ */ doc_tokens.is_empty() {
         return 0.0;
     }
     query_tokens
         .iter()
         .map(|q| {
             doc_tokens
                 .iter()
                 .map(|d| cosine(q, d))

---- simd::tests::test_maxsim_cosine_empty_doc stdout ----

thread 'simd::tests::test_maxsim_cosine_empty_doc' (12538840) panicked at src/simd.rs:367:9:
assertion `left == right` failed
  left: -inf
 right: 0.0

failures:
    simd::tests::test_maxsim_cosine_empty_doc

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
