*** src/simd.rs:88:5: replace maxsim_cosine -> f32 with 1.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim_cosine -> f32 with 1.0
@@ -80,28 +80,17 @@
         })
         .sum()
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
-        return 0.0;
-    }
-    query_tokens
-        .iter()
-        .map(|q| {
-            doc_tokens
-                .iter()
-                .map(|d| cosine(q, d))
-                .fold(f32::NEG_INFINITY, f32::max)
-        })
-        .sum()
+    1.0 /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Convenience wrappers for owned vectors
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// `MaxSim` for owned token vectors (convenience wrapper).
 ///

---- simd::tests::test_maxsim_cosine_empty_doc stdout ----

thread 'simd::tests::test_maxsim_cosine_empty_doc' (12566539) panicked at src/simd.rs:356:9:
assertion `left == right` failed
  left: 1.0
 right: 0.0

failures:
    simd::tests::test_maxsim_cosine_empty_doc

test result: FAILED. 123 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
