*** src/simd.rs:88:5: replace maxsim_cosine -> f32 with 0.0

*** mutation diff:
--- src/simd.rs
+++ replace maxsim_cosine -> f32 with 0.0
@@ -80,28 +80,17 @@
         })
         .sum()
 }
 
 /// `MaxSim` with cosine similarity instead of dot product.
 #[inline]
 #[must_use]
 pub fn maxsim_cosine(query_tokens: &[&[f32]], doc_tokens: &[&[f32]]) -> f32 {
-    if query_tokens.is_empty() || doc_tokens.is_empty() {
-        return 0.0;
-    }
-    query_tokens
-        .iter()
-        .map(|q| {
-            doc_tokens
-                .iter()
-                .map(|d| cosine(q, d))
-                .fold(f32::NEG_INFINITY, f32::max)
-        })
-        .sum()
+    0.0 /* ~ changed by cargo-mutants ~ */
 }
 
 // ─────────────────────────────────────────────────────────────────────────────
 // Convenience wrappers for owned vectors
 // ─────────────────────────────────────────────────────────────────────────────
 
 /// `MaxSim` for owned token vectors (convenience wrapper).
 ///

---- simd::tests::test_maxsim_cosine_basic stdout ----

thread 'simd::tests::test_maxsim_cosine_basic' (12577467) panicked at src/simd.rs:349:9:
assertion failed: (maxsim_cosine(&query, &doc) - 1.0).abs() < 1e-5

---- simd::tests::test_maxsim_cosine_vecs stdout ----

thread 'simd::tests::test_maxsim_cosine_vecs' (12577469) panicked at src/simd.rs:336:9:
assertion failed: (maxsim_cosine_vecs(&query, &doc) - 1.0).abs() < 1e-5

failures:
    simd::tests::test_maxsim_cosine_basic
    simd::tests::test_maxsim_cosine_vecs

test result: FAILED. 122 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.23s

*** result: Failure(101)
